[{"name":"accern-api","id":"6ad34583-a736-4bbe-9d39-940fdb7573f6","displayName":"Accern-API","description":"Get the most advanced breaking news technology for your investment strategies.","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"accountscore","id":"b015f9c4-c60a-4f66-abc6-c9b0e6b7f35e","displayName":"AccountScore","description":"AccountScore Open Banking & transaction analytics","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"actifio-go","id":"5f0db8c0-1817-11e9-93c9-57b51f6eaf9a","displayName":"Actifio GO","description":"SaaS platform for backup/DR/cloning/migration of Enterprise workloads in IBM Cloud","planUpdateable":true,"plans":[{"name":"standard-monthly","description":"Simple monthly pricing based on number of protected TB. Monthly bill will be based on the total TB under protection during the pay period. \nNote: This pricing is for VMware only. For pricing related to databases (SAP HANA, Oracle, Db2, MS SQL, etc.) and other workloads (Hyper-V, physical servers) please contact info@actifio.com."}]},{"name":"aiopenscale","id":"2ad019f3-0fd6-4c25-966d-f3952481a870","displayName":"Watson OpenScale","description":"IBM Watson OpenScale is an enterprise-grade environment for AI infused applications that provides enterprises with visibility into how AI is being built, used, and delivering ROI – at the scale of their business.","planUpdateable":true,"plans":[{"name":"lite","description":"The Watson OpenScale Lite Plan offers everything you need to begin your journey to deploying trusted AI across your business, including access to explainability, bias detection and mitigation, and automated AI capabilities."},{"name":"standard","description":"The Watson OpenScale Standard Plan will help accelerate your adoption of AI by building confidence in its outcomes and scaling it across your business. You'll have full access to OpenScale's capabilities, with pricing based on consumption."}]},{"name":"alloy","id":"d9ba7486-1a10-4a6d-86e6-ef0cf69bad85","displayName":"Alloy","description":"API for identity (KYC, AML & fraud)","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"api-gateway","id":"76fc0390-9024-11e8-b6c2-8d7309120d29","displayName":"API Gateway","description":"A developer-focused solution for creating, securing, and sharing API proxies and custom APIs backed by IBM Cloud resources.","planUpdateable":true,"plans":[{"name":"lite","description":"Create, secure, and share API proxies and custom APIs backed by IBM Cloud Functions, Cloud Foundry apps, and App Connect flows. After your block of 1M free calls is exhausted, API traffic may be throttled."}]},{"name":"apiconnect","id":"api-connect","displayName":"API Connect","description":"Create, manage, enforce, and run APIs.","planUpdateable":true,"plans":[{"name":"custom---enterprise","description":"Contact your sales rep today to turn your API Connect Professional on-premises plan into a hybrid plan, where you can share your API calls between the cloud and your on-prem installation. You can also use API Connect on IBM Cloud with App Connect as a part of the App Integration Suite (AIS). Note: Must contact sales to utilize this plan. Prices are only for OVERAGES above the contract limit."},{"name":"custom---professional","description":"Contact your sales rep today to turn your API Connect Professional on-premises plan into a hybrid plan, where you can share your API calls between the cloud and your on-prem installation. You can also use API Connect on IBM Cloud with App Connect as a part of the App Integration Suite (AIS). Note: Must contact sales to utilize this plan. Prices are only for OVERAGES above the contract limit."},{"name":"enterprise","description":"An enterprise-grade, comprehensive API solution for enterprises and cross department projects with flexibility of pay as you grow."},{"name":"enterprise-1b","description":"A high volume subscription plan offering a complete API solution for enterprise and cross departmental projects."},{"name":"enterprise-25m","description":"A subscription plan offering a complete API solution for enterprises and cross department projects."},{"name":"essentials---native","description":"This plan is already included in your Cloud Foundry or OpenWhisk runtimes! No need to re-provision it! API Management for Bluemix is a subset of developer-friendly API Connect features that control and secure RESTful runtimes with an API Gateway, available natively in several Bluemix services (including Cloud Foundry, OpenWhisk, and App Connect)."},{"name":"lite","description":"Create, run, manage, and secure APIs and microservices with the market leading API Management solution: API Connect. Get 50,000 free API calls per month. Start your API journey today!"}]},{"name":"appconnect","id":"96a0ebf2-2a02-4e32-815f-7c09a1268c78","displayName":"App Connect","description":"Connect your applications, automate tasks, and improve productivity","planUpdateable":true,"plans":[{"name":"appconnectcloudconnectors","description":"A plan for App Connect Enterprise software customers, provided at no additional charge, to access the cloud connectors in the App Connect managed service."},{"name":"appconnectplancustomenterprise","description":"A custom plan for customers in contact with an IBM sales representative."},{"name":"appconnectplancustomprofessional","description":"A subscription plan for pre-paid monthly usage, for customers in contact with an IBM sales representative."},{"name":"appconnectplanenterprise","description":"A flexible, pay-as-you-go plan to connect cloud and on-premise applications with reserved instance Integration Servers or as automated event-action flows and RESTful API flows, with no restriction on the number of active flows."},{"name":"appconnectplanprofessional","description":"A flexible, pay-as-you-go plan to connect cloud and on-premise applications, as automated event-action flows and RESTful API flows, with no restriction on the number of active flows."},{"name":"lite","description":"A no-charge plan to provide the essential functionality to connect cloud and on-premise applications, as automated event-action flows and RESTful APIs or enterprise integrations created in our most powerful Integrated Development Environment."}]},{"name":"appid","id":"AdvancedMobileAccess-d6aece47-d840-45b0-8ab9-ad15354deeea","displayName":"App ID","description":"User Authentication and User Profiles for your apps.","planUpdateable":true,"plans":[{"name":"graduated-tier","description":"Your first 1000 authentication events and first 1000 authorized users are free each month. All advanced security events have a cost which covers Two-Factor Authentication, Runtime Activity, and Advanced Password Policy."},{"name":"lite","description":"1000 monthly events and 1000 authorized users."}]},{"name":"at-t-flow-designer","id":"8514c706-225d-4848-a689-7c0a0bdcca17","displayName":"AT&T Flow Designer","description":"Design, Build and Deploy IoT Solutions in Minutes","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the Bluemix console."}]},{"name":"at-t-iot-data-plans","id":"7af3a600-6cf5-4047-a48d-264646af214c","displayName":"AT&T IoT Data Plans","description":"Launch your IoT product fast with IoT data plans","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"availabilitymonitoring","id":"IBM-Performance-Hub-1.0","displayName":"Availability Monitoring","description":"Around the world, around the clock availability and performance monitoring.","planUpdateable":true,"plans":[{"name":"lite","description":"Availability and response time measurements from multiple points of presence around the world."},{"name":"paid","description":"Availability and response time measurements from multiple points of presence around the world."}]},{"name":"biginsightsoncloud","id":"BigInsightsonCloud","displayName":"BigInsights for Apache Hadoop (Subscription)","description":"Provision managed bare metal Apache Hadoop clusters for production use or POCs at scale.","planUpdateable":false,"plans":[{"name":"enterprise","description":"Provides the ability to spin up Apache Hadoop and Apache Spark clusters on dedicated, bare metal infrastructure. Add on IBM BigInsights in-Hadoop analytics features. A secure, enterprise grade data and analytics platform with dedicated hardware, VPN option; ISO27001, SOC2 Type 1 certifications and HIPAA-ready. An IBM sales representative will contact you to complete the order."}]},{"name":"bigip","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-bigip","displayName":"F5 BIG-IP","description":"Optimize performance and ensure availability and security for applications with the F5 BIG-IP suite.","planUpdateable":false,"plans":[]},{"name":"bitbar-testing-cloud","id":"ebf44ee3-04ec-49ed-bb5a-0b76bc53bcc4","displayName":"Bitbar Testing Cloud","description":"Mobile device cloud with real devices only","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"blockchain","id":"6a0a8840-f899-11e8-bba8-6b3b2c5536be","displayName":"Blockchain Platform","description":"Welcome to the fast, flexible way to build, operate, and grow blockchain solutions.","planUpdateable":true,"plans":[{"name":"standard","description":"Quickly progress from development, to pilot, to production with a single plan that scales as you grow. Please note that you will be charged additionally for infrastructure and storage. File storage will be provisioned unless you change your Kubernetes storage preferences. Learn how to preview the platform for free on the \"About\" page of the cloud catalog."}]},{"name":"bondevalue-api","id":"6fdfccb4-1c28-4401-a94a-000bf75d889e","displayName":"Bondevalue-API","description":"Real time bonds data to manage one’s bond investments.","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"bosch-iot-rollouts","id":"d714e1f0-c19d-431e-b669-34b99b01708d","displayName":"Bosch IoT Rollouts","description":"Rollout software and firmware updates to devices","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"box","id":"adf18fe9-86c1-4c0e-9e31-b6725f4b5271","displayName":"box","description":"Powering Content and data for your application.  Whether you are building a line of business app, content management software or need to display content beautifully on web and mobile, the Box API can help power the content and data layer of your application.","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the Bluemix console."}]},{"name":"car-diagnostic-api","id":"37b751fd-75de-4757-b3b8-f33c3cd7e1ec","displayName":"Car Diagnostic API","description":"Translation service for OBD error codes.","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"caveonix","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-caveonix","displayName":"Caveonix RiskForesight","description":"Manage cyber and compliance risk with proactive monitoring and automated defense controls to protect against threats and meet industry or government regulations","planUpdateable":false,"plans":[]},{"name":"cfaas","id":"c4cfe2d0-01ef-11e8-bd2c-cbf81959e223","displayName":"Cloud Foundry Enterprise Environment","description":"An isolated environment for hosting your Cloud Foundry apps with full admin control over configuration, capacity and access.","planUpdateable":true,"plans":[{"name":"lite","description":"Explore Eirini in your Cloud Foundry Enterprise Environment. Eirini is a Cloud Foundry incubation project that uses native Kubernetes as the container scheduler (instead of Diego) to deploy and run apps in the Cloud Foundry application runtime."},{"name":"standard","description":"Explore the essential capabilities of Cloud Foundry running in full isolation, choosing among different data centers to meet your isolation and data resiliency needs."}]},{"name":"cldamqp","id":"42152430-a05b-11e8-824e-7db9808a1cf3","displayName":"CloudAMQP","description":"RabbitMQ  as a Service","planUpdateable":true,"plans":[{"name":"ape","description":"Awesome Ape - For production"},{"name":"bunny","description":"Big Bunny - For production"},{"name":"hippo","description":"Heavy Hippo"},{"name":"lion","description":"Loud Lion - For production"},{"name":"lite","description":"Plan Little Lemur - For Development"},{"name":"panda","description":"Power Panda - For production"},{"name":"rabbit","description":"Roaring Rabbit - For production"},{"name":"tiger","description":"Tough Tiger - For Hobby Apps"}]},{"name":"cloudantnosqldb","id":"cloudant","displayName":"Cloudant","description":"A scalable JSON document database for web, mobile, IoT, and serverless applications.","planUpdateable":true,"plans":[{"name":"dedicated-hardware","description":"The Dedicated Hardware plan is a bare metal environment provisioned for the sole use of your Cloudant Standard plan instance(s) for isolation, security, and compliance purposes. You can provision one or more Standard plan instances and the Dedicated Hardware environment will expand/contract as needed based on capacity and data used by the Standard plan instances.  It is an add-on fixed price to the consumption pricing of Cloudant Standard plan instance(s). Billing is prorated daily and provisioning is asynchronous and may take 5-7 business days. Dedicated Hardware environments provisioned after January 1, 2019 in a major IBM Cloud location will support internal endpoints for all instances deployed on them. NOTE: THERE IS A 1 MONTH MINIMUM CHARGE AFTER CLICKING CREATE SO TAKE CAUTION IN PROVISIONING."},{"name":"lite","description":"The Lite plan provides access to the full functionality of Cloudant for development and evaluation. The plan has a set amount of provisioned throughput capacity as shown and includes a max of 1GB of encrypted data storage. Users exceeding data storage limit will have instances disabled for writes until total storage is below 1GB or instance is upgraded to Standard plan. Users are limited to one Lite plan instance per service."},{"name":"standard","description":"The Standard plan is priced based on provisioned throughput capacity allocated and data storage used, with billing prorated hourly. The provisioned throughput capacity starts at 100 reads/sec, 50 writes/sec, and 5 global queries/sec (USD$0.105/hour) with the ability to increase the capacity in increments of 100 reads/sec, 50 writes/sec, and 5 global queries/sec after instance is provisioned. Note that costs are for the provisioned throughput capacity allocated and not on the metered volume of requests. The Standard plan includes 20GB of encrypted data storage, with additional storage metered for purchase. See the capacity slider or the IBM Cloud Cost Calculator to estimate costs."}]},{"name":"cloudcerts","id":"cc56b926-cfa1-4f50-ab9d-01986ff692be","displayName":"Certificate Manager","description":"Use Certificate Manager to order and manage SSL/TLS certificates for your apps and services","planUpdateable":false,"plans":[{"name":"free","description":"The Free plan offers full access to all of the Certificate Manager service capabilities for free."}]},{"name":"cloudeventmanagement","id":"CloudEventManagement16a036f0-f1fc-11e6-a38d-394caee7d66d","displayName":"Event Management","description":"Consolidated operational event and incident management.","planUpdateable":false,"plans":[{"name":"standard","description":"The standard plan provides access to the full functionality of Cloud Event Management. The plan has a set amount of free usage: 500 events, 5000 digital messages and 5000 runbook executions per month, beyond which additional usage is charged for."}]},{"name":"compare-comply","id":"61cdfc0c-5835-48a8-bb6a-ec2ddfa626e6","displayName":"Compare and Comply","description":"Process governing documents to convert, identify, classify, and compare important elements","planUpdateable":true,"plans":[{"name":"lite-ga","description":"This plan allows you to classify elements in a document, compare two documents, and provide Feedback for improving a domain model."},{"name":"premium","description":"To purchase a premium plan, visit: https://ibm.biz/contact-wdc-premium"},{"name":"standard","description":"This plan allows you to classify elements in a document, compare two documents, provide Feedback used to improve domain models, as well as advanced capabilities such as document conversion and understanding tables."}]},{"name":"compose-enterprise","id":"ComposeEnterprise-P","displayName":"Compose Enterprise","description":"IBM Compose Enterprise is a service which provides a private isolated cluster for IBM Cloud users to optionally provision their Compose databases into.","planUpdateable":false,"plans":[{"name":"enterprise","description":"IBM Compose Enterprise is provided as a single feature plan; databases deployed to the service are billed at their normal rates. It may take up to 5-7 business days for provisioning. Please note: Content is primarily hosted in the selected location, however, artifacts such as logs, backups and other systems support data, which may include Content, may be hosted in other Data Centers."}]},{"name":"compose-for-janusgraph","id":"ComposeJanusGraph-P","displayName":"Compose for JanusGraph","description":"JanusGraph is a scalable graph database optimized for storing and querying highly-interconnected data","planUpdateable":false,"plans":[{"name":"enterprise","description":"The Enterprise plan allows the database service to be provisioned within an IBM Compose Enterprise cluster. This is a service which provides a private, dedicated and isolated cluster for customers. To use this plan, a Compose Enterprise cluster has to have been provisioned through the IBM Compose Enterprise service. The database service itself is billed at the shown rates."},{"name":"standard","description":"One database instance on Compose cluster starts with 5GB Storage on the JanusGraph Storage and 512MB RAM on the JanusGraph Engine. The Storage and Engine components can be provisioned depending on the nature of your workload."}]},{"name":"compose-for-mysql","id":"ComposeMySQL-P","displayName":"Compose for MySQL","description":"MySQL is a fast, easy-to-use, and flexible RDBMS.","planUpdateable":false,"plans":[{"name":"enterprise","description":"The Enterprise plan allows the database service to be provisioned within an IBM Compose Enterprise cluster. This is a service which provides a private, dedicated and isolated cluster for customers. To use this plan, a Compose Enterprise cluster has to have been provisioned through the IBM Compose Enterprise service. The database service itself is billed at the shown rates."},{"name":"standard","description":"One database instance on a Compose cluster. Starts with 1GB Storage / 102MB RAM and scales automatically with your data."}]},{"name":"compose-for-rethinkdb","id":"ComposeRethinkDB-P","displayName":"Compose for RethinkDB","description":"RethinkDB is a JSON document based, distributed database with an integrated administration and exploration console.","planUpdateable":false,"plans":[{"name":"enterprise","description":"The Enterprise plan allows the database service to be provisioned within an IBM Compose Enterprise cluster. This is a service which provides a private, dedicated and isolated cluster for customers. To use this plan, a Compose Enterprise cluster has to have been provisioned through the IBM Compose Enterprise service. The database service itself is billed at the shown rates."},{"name":"standard","description":"One database instance on a Compose cluster. Starts with 1GB Storage / 102MB RAM and scales automatically with your data."}]},{"name":"compose-for-scylladb","id":"ComposeScyllaDB-P","displayName":"Compose for ScyllaDB","description":"ScyllaDB is a highly performant, in-place replacement for the Cassandra wide-column distributed database.","planUpdateable":false,"plans":[{"name":"enterprise","description":"The Enterprise plan allows the database service to be provisioned within an IBM Compose Enterprise cluster. This is a service which provides a private, dedicated and isolated cluster for customers. To use this plan, a Compose Enterprise cluster has to have been provisioned through the IBM Compose Enterprise service. The database service itself is billed at the shown rates."},{"name":"standard","description":"One database instance on a Compose cluster. Starts with 5GB Storage / 512MB RAM and scales automatically with your data."}]},{"name":"consult-with-icg-wes","id":"2f756420-434f-11e8-ae40-6bdd72502abc","displayName":"Consult with IBM Garage","description":"Work with IBM Garage on your next project!","planUpdateable":false,"plans":[{"name":"architecture-workshop","description":"Are you modernizing an existing application or building a new application for IBM Cloud?  Get in-depth, expert guidance on deployment of IBM Cloud in your environment."},{"name":"cloud-native-developer-bootcamp","description":"The IBM Cloud Native Bootcamp is course setup to introduce developers to cloud native development concepts and tooling.  Through this course, students will learn how to develop, test, deploy, and manage cloud native applications."},{"name":"design-thinking-workshop","description":"Explore the problem and opportunity space to arrive on a solution vision and a crisply defined minimum viable product (MVP) statement.  Align stakeholders around the solution hypothesis, MVP and the next steps needed to start building."},{"name":"garage-mvp-build","description":"Co-create with a team of Garage developers, architects and designers, to build and deploy a user-ready, cloud–native, minimum viable product using the IBM Garage Methodology."},{"name":"learn--2-days-","description":"Get practical experience with Watson APIs in this 2-day Learn session. You gain access to Watson standard practices and methodology from the IBM Watson Expert Services team. Session selection must be confirmed before scheduling services."},{"name":"learn--4-days-","description":"Get practical experience with Watson APIs in this 4-day Learn session. You gain access to Watson standard practices and methodology from the IBM Watson Expert Services team. Session selection must be confirmed before scheduling services."},{"name":"on-demand-consulting--standard-","description":"Gain remote access to IBM’s Data & AI Experts and Watson Academy education resources, for up to 5 users during all phases of a project life cycle for 3 months. Additionally, get 3 hours of mentoring time to be used for activities during the term of this Cloud Service."},{"name":"on-demand-consulting-2-premium-","description":"Gain remote access to IBM’s Data & AI Experts and Watson Academy education resources, for up to 10 users during all phases of a project life cycle for 3 months. Additionally, get 48 hours of mentoring time to be used for activities during the term of this Cloud Service."}]},{"name":"container-registry","id":"public.bluemix.container.registry","displayName":"Container Registry","description":"Securely store container images and monitor their vulnerabilities in a private registry.","planUpdateable":true,"plans":[{"name":"free","description":"Default plan"},{"name":"standard","description":"Unlimited Plan"}]},{"name":"containers-kubernetes","id":"containers-kubernetes","displayName":"Kubernetes Service","description":"Deploy secure, highly available apps in a native Kubernetes experience. IBM Cloud Kubernetes Service creates a cluster of compute hosts and deploys highly available containers.","planUpdateable":true,"plans":[{"name":"16x128-baremetal-instance-gpu","description":"16x128 Bare Metal Medium GPU (16 cores, 128GB Memory, 1.7TB SSD, 10Gbps Bonded Network, 1GPU Card) per Instance Pay per Use"},{"name":"16x128-shared-instance","description":"16x128 Shared Instance (16 CPU, 128 GB RAM, 100 GB SSD) per Instance-Hour Pay per Use"},{"name":"16x16-dedicated-instance","description":"16x16 Private Instance (16 CPU, 16 GB RAM, 100 GB HD) per 10 Instance-Hour Pay per Use"},{"name":"16x16-shared-instance","description":"16x16 Public Instance (16 CPU, 16 GB RAM, 100 GB SSD) per 10 Instance-Hour Pay per Use"},{"name":"16x32-dedicated-instance","description":"16x32 Private Instance (16 CPU, 32 GB RAM, 100 GB HD) per Instance-Hour Pay per Use"},{"name":"16x32-shared-instance","description":"16x32 Public Instance (16 CPU, 32 GB RAM, 100 GB SSD) per 10 Instance-Hour Pay per Use"},{"name":"16x64-1-9tb-ssd-baremetal-instance","description":"16x64.1.9tb.ssd Bare Metal SDS (16 cores, 64GB Memory, Raw 1.9TB SSD, 10Gbps Bonded Network) per Instance Pay per Use"},{"name":"16x64-baremetal-instance","description":"16x64 Bare Metal Medium (16 cores, 64GB Memory, 960GB SSD, 10Gbps Bonded Network) per Instance Pay per Use"},{"name":"16x64-baremetal-instance-data","description":"16x64.4x4tb Bare Metal Medium Data (16 cores, 64GB Memory, 4x4TB SATA RAID10, 10Gbps Bonded Network) per Instance Pay per Use"},{"name":"16x64-dedicated-instance","description":"16x64 Dedicated Instance (16 CPU, 64 GB RAM, 100 GB HDD)"},{"name":"16x64-shared-instance","description":"16x64 Shared Instance (16 CPU, 64 GB RAM, 100 GB SSD)"},{"name":"28x256-3-8tb-ssd-baremetal-instance","description":"28x256.3.8tb.ssd Bare Metal SDS (28 cores, 256GB Memory, Raw 3.8TB SSD, 10Gbps Bonded Network) per Instance Pay per Use"},{"name":"28x256-baremetal-instance-gpu","description":"28x256 Bare Metal Large GPU (28 cores, 256GB Memory, 1.7TB SSD, 10Gbps Bonded Network, 2GPU Cards) per Instance Pay per Use"},{"name":"28x512-4x3-8tb-ssd-baremetal-instance","description":"28x512.4x3.8tb.ssd Bare Metal SDS (28 cores, 512GB Memory, 4 x Raw 3.8TB SSD, 10Gbps Bonded Network) per Instance Pay per Use"},{"name":"28x512-baremetal-instance","description":"28x512 Bare Metal Large (28 cores, 512GB Memory, 960GB SSD, 10Gbps Bonded Network) per Instance Pay per Use"},{"name":"28x512-baremetal-instance-data","description":"28x512.4x4tb  Bare Metal Large Data (28 cores, 512GB Memory, 4x4TB SATA RAID10, 10Gbps Bonded Network) per Instance Pay per Use"},{"name":"2x4-dedicated-instance","description":"2x4 Dedicated Instance (2 CPU, 4 GB RAM, 100 GB HDD)"},{"name":"2x4-shared-instance","description":"2x4 Shared Instance (2 CPU, 4 GB RAM, 100 GB SSD)"},{"name":"30x240-shared-instance","description":"30x240 Shared Instance (30 CPU, 240 GB RAM, 100 GB SSD) per Instance-Hour Pay per Use"},{"name":"32x128-dedicated-instance","description":"32x128 Dedicated Instance (32 CPU, 128 GB RAM, 100 GB HDD)"},{"name":"32x128-shared-instance","description":"32x128 Shared Instance (32 CPU, 128 GB RAM, 100 GB SSD)"},{"name":"32x32-dedicated-instance","description":"32x32 Private Instance (32 CPU, 32 GB RAM, 100 GB HD) per Instance-Hour Pay per Use"},{"name":"32x32-shared-instance","description":"32x32 Public Instance (32 CPU, 32 GB RAM, 100 GB SSD) per Instance-Hour Pay per Use"},{"name":"32x64-dedicated-instance","description":"32x64 Private Instance (32 CPU, 64 GB RAM, 100 GB HD) per Instance-Hour Pay per Use"},{"name":"32x64-shared-instance","description":"32x64 Public Instance (32 CPU, 64 GB RAM, 100 GB SSD) per Instance-Hour Pay per Use"},{"name":"48x384-shared-instance","description":"48x384 Shared Instance (48 CPU, 384 GB RAM, 100 GB SSD) per Instance-Hour Pay per Use"},{"name":"4x16-dedicated-instance","description":"4x16 Dedicated Instance (4 CPU, 16 GB RAM, 100 GB HDD)"},{"name":"4x16-shared-instance","description":"4x16 Shared Instance (4 CPU, 16 GB RAM, 100 GB SSD)"},{"name":"4x32-1-9tb-ssd-baremetal-instance","description":"4x32.1.9tb.ssd Bare Metal SDS (4 cores, 32GB Memory, Raw 1.9TB SSD, 10Gbps Bonded Network) per Instance Pay per Use"},{"name":"4x32-baremetal-instance","description":"4x32 Bare Metal Small (4 cores, 32GB Memory, 2TB SATA, 10Gbps Bonded Network)"},{"name":"56x242-dedicated-instance","description":"56x242 Dedicated Instance (56 CPU, 242 GB RAM, 100 GB HDD)"},{"name":"56x242-shared-instance","description":"56x242 Shared Instance (56 CPU, 242 GB RAM, 100 GB SSD)"},{"name":"56x448-shared-instance","description":"56x448 Shared Instance (56 CPU, 448 GB RAM, 100 GB SSD) per Instance-Hour Pay per Use"},{"name":"64x512-shared-instance","description":"64x512 Shared Instance (64 CPU, 512 GB RAM, 100 GB SSD) per Instance-Hour Pay per Use"},{"name":"8x32-dedicated-instance","description":"8x32 Private Instance (8 CPU, 32 GB RAM, 100 GB HD) per 10 Instance-Hour Pay per Use"},{"name":"8x32-shared-instance","description":"8x32 Public Instance (8 CPU, 32 GB RAM, 100 GB SSD) per 10 Instance-Hour Pay per Use"},{"name":"8x64-shared-instance","description":"8x64 Shared Instance (8 CPU, 64 GB RAM, 100 GB SSD) per Instance-Hour Pay per Use"},{"name":"containers-kubernetes-multizone-load-balancer","description":"Kubernetes Service MZLB and NLB Host DNS Monitor"},{"name":"containers-kubernetes-vpc-gen2","description":"IBM Cloud Kubernetes Service for Virtual Private Cloud (VPC) Gen2"},{"name":"lite","description":"IBM Cloud Kubernetes Service includes a free cluster that comes with 2 vCPUs, 4 GB memory, and 1 worker node."},{"name":"redhat-openshift-cost","description":"Red Hat OpenShift on IBM Cloud 4 vCPUs Instance Pay per Use"}]},{"name":"continuous-delivery","id":"59b735ee-5938-4ebd-a6b2-541aef2d1f68","displayName":"Continuous Delivery","description":"Support DevOps best practices by using Git, issue tracking, CI/CD pipelines, and the Eclipse Orion Web IDE in the Cloud.","planUpdateable":true,"plans":[{"name":"lite","description":"The Lite plan offers the full capabilities of Continuous Delivery, with usage limits, to small teams at no cost."},{"name":"professional","description":"The Professional plan offers the full capabilities of Continuous Delivery to all users in your organization or resource group for a monthly per-user charge."}]},{"name":"contrast-security","id":"6777716b-e36e-4e9c-a239-6b9ed99dc12c","displayName":"Contrast Security","description":"Detect vulnerabilities and block attacks","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"conversation","id":"7045626d-55e3-4418-be11-683a26dbc1e5","displayName":"Watson Assistant","description":"Watson Assistant lets you build conversational interfaces into any application, device, or channel.","planUpdateable":true,"plans":[{"name":"free","description":"The Lite plan gets you started with 10,000 API calls per month at no cost. And when you upgrade to a paid plan, you’ll keep all your intents, entities, dialog flows, and chat logs."},{"name":"plus","description":"Learn more about user based billing here https://cloud.ibm.com/docs/assistant?topic=assistant-services-information#services-information-user-based-plans. Plus plan instances can't be downgraded to lower-tier plans."},{"name":"plus-trial","description":"Plus Trial Plan"},{"name":"premium-userbased","description":"To purchase a premium plan, visit: https://ibm.biz/contact-wdc-premium"},{"name":"standard","description":"Standard"}]},{"name":"dashdb","id":"9e02e72d-00ce-4220-b44c-650c8314e58a","displayName":"Db2 Warehouse","description":"Db2 Warehouse on Cloud is a flexible and powerful data warehouse for enterprise-level analytics.","planUpdateable":false,"plans":[{"name":"flex","description":"The base Instance provides one database with 960GB disk storage, 16 cores, and 186GB RAM. Scale storage up to 96TB, and scale compute up to 160 cores."},{"name":"flex-endurance-for-aws","description":"The base Instance provides one database with 960GB disk storage and 14 virtual processor cores. Scale storage up to 144TB in increments of 960GB, and scale compute up to 112 virtual processor cores in increments of 14 virtual processor cores."},{"name":"flex-one","description":"The base Instance provides one database with 40GB disk storage and 6 virtual processor cores (VPCs). Scale storage up to 4TB, and scale compute up to 28 VPCs."},{"name":"flex-performance","description":"The base Instance provides one database with 2.4TB disk storage, 48 cores, and 1TB RAM."},{"name":"flex-performance-for-aws","description":"The base Instance provides one database with 2.4TB disk storage and 48 virtual processor cores. Scale storage up to 144TB in increments of 2.4TB, and scale compute up to 576 virtual processor cores in increments of 24 virtual processor cores."},{"name":"hybrid-flex","description":"Customers who currently hold an active subscription to the IBM Hybrid Data Management Platform are eligible to purchase the Db2 Warehouse on Cloud Hybrid Flex plan. The base Instance provides one database with 960 GB disk storage, 16 cores, and 186 GB RAM. Scale storage up to 96 TB, and scale compute up to 160 cores. Compute and storage resources will be metered hourly and billed against your HDMP FlexPoint entitlement. To learn more or subscribe to the Hybrid Data Management Platform, please visit: https://ibm.biz/hybrid-data-management-marketplace-page. For existing customers, FlexPoint entitlements can be monitored and managed at: https://hybrid-cloud-usage-hub.mybluemix.net."},{"name":"hybrid-flex-for-amazon-web-services","description":"Customers who currently hold an active subscription to the IBM Hybrid Data Management Platform are eligible to purchase the Db2 Warehouse on Cloud Hybrid Flex for AWS plan. The base Instance provides one database with 960GB disk storage and 14 virtual processor cores. Scale storage up to 144TB and scale compute up to 112 virtual processor cores. Compute and storage resources will be metered hourly and billed against your HDMP FlexPoint entitlement. To learn more or subscribe to the Hybrid Data Management Platform, please visit: https://ibm.biz/hybrid-data-management-marketplace-page. For existing customers, FlexPoint entitlements can be monitored and managed at: https://hybrid-cloud-usage-hub.mybluemix.net."},{"name":"hybrid-flex-performance","description":"Customers who currently hold an active subscription to the IBM Hybrid Data Management Platform are eligible to purchase the Db2 Warehouse on Cloud Hybrid Flex plan. This plan includes one database with 2.4 TB disk storage, 48 cores, and 864 GB RAM. Scale storage up to 96 TB in increments of 2.4 TB, and scale compute up to 576 cores in increments of 24 cores. Each 24-core increment provides an additional 432 GB RAM. Compute and storage resources will be metered hourly and billed against your HDMP FlexPoint entitlement. To learn more or subscribe to the Hybrid Data Management Platform, please visit: https://ibm.biz/hybrid-data-management-marketplace-page. For existing customers, FlexPoint entitlements can be monitored and managed at: https://hybrid-cloud-usage-hub.mybluemix.net."},{"name":"hybrid-flex-performance-for-amazon-web-services","description":"Customers who currently hold an active subscription to the IBM Hybrid Data Management Platform are eligible to purchase the Db2 Warehouse on Cloud Hybrid Flex Performance for AWS plan. The base Instance provides one database with 2.4TB disk storage and 48 virtual processor cores. Scale storage up to 144TB in increments of 2.4TB, and scale compute up to 576 virtual processor cores in increments of 24 virtual processor cores. Compute and storage resources will be metered hourly and billed against your HDMP FlexPoint entitlement. To learn more or subscribe to the Hybrid Data Management Platform, please visit: https://ibm.biz/hybrid-data-management-marketplace-page. For existing customers, FlexPoint entitlements can be monitored and managed at: https://hybrid-cloud-usage-hub.mybluemix.net."}]},{"name":"dashdb-for-transactions","id":"dashdb-for-transactions","displayName":"Db2","description":"A next generation SQL database. Formerly dashDB For Transactions.","planUpdateable":false,"plans":[{"name":"enterprisefortransactions2-8-500","description":"IBM's Precise Performance plans offer the best performance per dollar by leveraging reserved resources. For systems that scale on-demand, consider the Flex plan instead. One SQL database per service instance on a dedicated virtual server with 8GB RAM and 2 vCPUs. Provides up to 500GB of storage for data and logs. All billing methods are supported, including credit card and Bluemix subscription. Price is based on a full month of usage, but customers are only billed for days of service activated. (IBM Part: EnterpriseForTransactions 2.8.500)"},{"name":"enterprisefortransactionsflex","description":"The base plan includes one database per service instance with 4GB RAM and 1 Core on a dedicated virtual server.  Provides 2GB of storage for data and logs. High availability option available. Scale RAM and storage dynamically with flexible pricing. If using high availability, the cost of RAM and storage is doubled. All billing methods are supported, including credit card and Bluemix subscription. (IBM Part: EnterpriseForTransactions Flex)"},{"name":"enterprisetransactional12-128-1400","description":"IBM's Precise Performance plans offer the best performance per dollar by leveraging reserved resources. For systems that scale on-demand, consider the Flex plan instead. This plan includes one database per service instance on a dedicated bare metal server with 128GB RAM and 16 Cores. Provides up to 1400GB of SSD storage for data and logs. This plan requires a minimum charge of 30 days of usage. 14 days advance notice is required to discontinue usage of this plan. All billing methods are supported, including credit card and Bluemix subscription. (IBM Part: EnterpriseForTransactions 12.128.1400)"},{"name":"free","description":"The Free plan provides a free Db2 service for development and evaluation. The plan has a set amount of limitations as shown. You can continue using the free plan for as long as needed, however, users are asked to re-extend their free account every 90 days by email. If you do not re-extend, your free account is cleaned out a further 90 days later. This helps provide free resources for everyone."},{"name":"hdmp-enterprisefortransactionsflex","description":"Customers who currently hold an active subscription to the IBM Hybrid Data Management Platform are eligible to purchase the Db2 on Cloud Hybrid Flex plan. This plan includes one database per service instance with 4 GB RAM and 1 virtual processor core (VPC) on a dedicated virtual server. The base instance also provides 2 GB of storage for data and logs. Scale compute and storage resources dynamically, which will be metered hourly and billed against your HDMP FlexPoint entitlement. To learn more or subscribe to the Hybrid Data Management Platform, please visit: https://ibm.biz/hybrid-data-management-marketplace-page. For existing customers, FlexPoint entitlements can be monitored and managed at: https://hybrid-cloud-usage-hub.mybluemix.net."}]},{"name":"data-science-experience","id":"39ba9d4c-b1c5-4cc3-a163-38b580121e01","displayName":"Watson Studio","description":"Embed AI and machine learning into your business. Create custom models using your own data.","planUpdateable":true,"plans":[{"name":"enterprise-v2","description":"The Enterprise plan for Watson Studio enables your team to solve problems and gain a competitive advantage with enterprise-scale data science and AI. For HIPAA support, you must enable it in your IBM Cloud account settings. For instructions, go to https://dataplatform.cloud.ibm.com/docs/content/getting-started/security.html#hipaa"},{"name":"free-v1","description":"The Lite plan for Watson Studio offers everything you need to become a better data scientist or domain expert in a collaborative environment."},{"name":"sqo-enterprise-v2","description":"The Enterprise plan for Watson Studio enables your team to solve problems and gain a competitive advantage with enterprise-scale data science and AI. For HIPAA support, you must enable it in your IBM Cloud account settings. For instructions, go to https://dataplatform.cloud.ibm.com/docs/content/getting-started/security.html#hipaa"},{"name":"standard-v1","description":"The Standard plan for Watson Studio enables your team to solve problems and gain a competitive advantage with enterprise-scale data science and AI."}]},{"name":"data-shield","id":"46a4e75b-8ce6-4a51-9125-76c1652fb787","displayName":"IBM Cloud Data Shield","description":"IBM Cloud™ Data Shield enables users to run containerized applications in a secure enclave on an IBM Cloud Kubernetes host, providing data-in-use protection","planUpdateable":false,"plans":[{"name":"standard-data-shield","description":"IBM Cloud Data Shield can run containerized applications in secure enclaves on the IBM Cloud Service."}]},{"name":"compose-for-elasticsearch","id":"ComposeElasticsearch-P","displayName":"Compose for Elasticsearch","description":"Elasticsearch combines the power of a full text search engine with the indexing strengths of a JSON document database. Consider using our next generation service, Databases for Elasticsearch.","planUpdateable":false,"plans":[{"name":"enterprise","description":"The Enterprise plan allows the database service to be provisioned within an IBM Compose Enterprise cluster. This is a service which provides a private, dedicated and isolated cluster for customers. To use this plan, a Compose Enterprise cluster has to have been provisioned through the IBM Compose Enterprise service. The database service itself is billed at the shown rates."},{"name":"standard","description":"One database instance on a Compose cluster. Starts with 2GB Storage / 204MB RAM and scales automatically with your data."}]},{"name":"databases-for-elasticsearch","id":"databases-for-elasticsearch","displayName":"Databases for Elasticsearch","description":"Elasticsearch combines the power of a full text search engine with the indexing strengths of a JSON document database.","planUpdateable":false,"plans":[{"name":"standard","description":"One highly available Elasticsearch instance with three data members. The Standard plan is priced based on disk storage, RAM, backup storage, and vCPUs allocated to deployments, prorated hourly. Databases for Elasticsearch instances have a minimum of 5GB of Disk and 1GB of RAM per data member. Dedicated cores can optionally be provisioned at a minimum of 3 cores per member."}]},{"name":"compose-for-etcd","id":"ComposeEtcd-P","displayName":"Compose for etcd","description":"etcd is a distributed reliable key-value store for the most critical data of a distributed system. Consider using our next generation service, Databases for etcd.","planUpdateable":false,"plans":[{"name":"enterprise","description":"The Enterprise plan allows the database service to be provisioned within an IBM Compose Enterprise cluster. This is a service which provides a private, dedicated and isolated cluster for customers. To use this plan, a Compose Enterprise cluster has to have been provisioned through the IBM Compose Enterprise service. The database service itself is billed at the shown rates."},{"name":"standard","description":"One database instance on a Compose cluster. Starts with 256MB Storage and scales automatically with your data."}]},{"name":"databases-for-etcd","id":"databases-for-etcd","displayName":"Databases for etcd","description":"etcd is a distributed reliable key-value store for the most critical data of a distributed system","planUpdateable":false,"plans":[{"name":"standard","description":"One highly available etcd instance with three data members. The Standard plan is priced based on disk (IOPS), RAM, backup storage, and vCPUs allocated to deployments, prorated hourly. Databases for etcd instances have a minimum of 200 IOPS (20GB storage) and 1GB of RAM per data member. All storage is 10 IOPS per gigabyte of disk and users can provision more IOPS for an instance by scaling disk allocation. Dedicated cores can optionally be provisioned at a minimum of 3 cores per member."}]},{"name":"compose-for-mongodb","id":"ComposeMongo-P","displayName":"Compose for MongoDB","description":"MongoDB is a JSON document store with a rich query and aggregation framework.","planUpdateable":false,"plans":[{"name":"enterprise","description":"The Enterprise plan allows the database service to be provisioned within an IBM Compose Enterprise cluster. This is a service which provides a private, dedicated and isolated cluster for customers. To use this plan, a Compose Enterprise cluster has to have been provisioned through the IBM Compose Enterprise service. The database service itself is billed at the shown rates."},{"name":"standard","description":"One database instance on a Compose cluster. Starts with 1GB Storage / 102MB RAM and scales automatically with your data."}]},{"name":"databases-for-mongodb","id":"databases-for-mongodb","displayName":"Databases for MongoDB","description":"MongoDB is a JSON document store with a rich query and aggregation framework.","planUpdateable":false,"plans":[{"name":"standard","description":"One highly available MongoDB instance with two data members. The Standard plan is priced based on disk storage, RAM, and backup storage allocated to deployments, prorated hourly. Databases for MongoDB instances have a minimum of 10GB of Disk and 1GB of RAM per data member."}]},{"name":"compose-for-postgresql","id":"ComposePostgreSQL-P","displayName":"Compose for PostgreSQL","description":"PostgreSQL is an open source relational database. Consider using our next generation service, Databases for PostgreSQL.","planUpdateable":false,"plans":[{"name":"enterprise","description":"The Enterprise plan allows the database service to be provisioned within an IBM Compose Enterprise cluster. This is a service which provides a private, dedicated and isolated cluster for customers. To use this plan, a Compose Enterprise cluster has to have been provisioned through the IBM Compose Enterprise service. The database service itself is billed at the shown rates."},{"name":"standard","description":"One database instance on a Compose cluster. Starts with 1GB Storage / 102MB RAM and scales automatically with your data."}]},{"name":"databases-for-postgresql","id":"databases-for-postgresql","displayName":"Databases for PostgreSQL","description":"PostgreSQL is a powerful, open source object-relational database that is highly customizable.","planUpdateable":false,"plans":[{"name":"standard","description":"One highly available PostgreSQL instance with two data members. The Standard plan is priced based on disk storage, RAM, backup storage, and vCPUs allocated to deployments, prorated hourly. Databases for PostgreSQL instances have a minimum of 5GB of Disk and 1GB of RAM per data member. Dedicated cores can optionally be provisioned at a minimum of 3 cores per member."}]},{"name":"compose-for-redis","id":"ComposeRedis-P","displayName":"Compose for Redis","description":"Redis is a blazingly fast, in-memory data structure store. Consider using our next generation service, Databases for Redis.","planUpdateable":false,"plans":[{"name":"enterprise","description":"The Enterprise plan allows the database service to be provisioned within an IBM Compose Enterprise cluster. This is a service which provides a private, dedicated and isolated cluster for customers. To use this plan, a Compose Enterprise cluster has to have been provisioned through the IBM Compose Enterprise service. The database service itself is billed at the shown rates."},{"name":"standard","description":"One database instance on a Compose cluster. Starts with 256MB Storage and scales automatically with your data."}]},{"name":"databases-for-redis","id":"databases-for-redis","displayName":"Databases for Redis","description":"Redis is a blazingly fast, in-memory data structure store.","planUpdateable":false,"plans":[{"name":"standard","description":"One highly available Redis instance with two data members. The Standard plan is priced based on disk storage, RAM, backup storage, and vCPUs allocated to deployments, prorated hourly. Databases for Redis instances have a minimum of 1GB of Disk and 1GB of RAM per data member. Dedicated cores can optionally be provisioned at a minimum of 3 cores per member."}]},{"name":"datacatalog","id":"ed3a5a53-eb60-4f3c-8fd1-17f88585b6ed","displayName":"Knowledge Catalog","description":"Discover, catalog, and securely share enterprise data.","planUpdateable":true,"plans":[{"name":"lite","description":"The Lite plan for Watson Knowledge Catalog offers everything you need to begin your journey to becoming a data-centric organization."},{"name":"professional","description":"The Professional plan for Watson Knowledge Catalog includes everything in the Lite plan, plus control of data access by defining policies and monitoring enforcement."},{"name":"sqo","description":"The SQO Professional plan for Watson Knowledge Catalog includes everything in the Lite plan, plus unlimited catalogs, unlimited assets, control of data access by defining policies and monitoring enforcement."},{"name":"sqo-standard","description":"The SQO Standard plan for Watson Knowledge Catalog includes everything in the Lite plan, plus control of data access by defining policies and monitoring enforcement."},{"name":"standard","description":"The Standard plan for Watson Knowledge Catalog includes everything in the Lite plan, plus control of data access by defining policies and monitoring enforcement."}]},{"name":"db2oncloud","id":"3d6e097c-b3b2-482a-b92d-6da183602cb6","displayName":"Db2 Hosted","description":"Db2 Hosted: Offers customers the rich features of an on-premise Db2 deployment without the cost, complexity, and risk of managing their own infrastructure.","planUpdateable":true,"plans":[{"name":"db2oncloud-flex","description":"The base plan includes service instance with 4GB RAM and 1 Virtual Processor Core (VPC) on a dedicated virtual server. Provides 100GB of storage for data and logs. Deploys with an additional 100GB of storage reserved solely for the operating system. Scale compute (VPCs, RAM) and storage resources dynamically with flexible pricing. All billing methods are supported, including credit card and IBM Cloud subscription. This plan comes with a Db2 Advanced Server Enterprise Edition license. It can be set up to use HADR (an additional server is required for HADR). This plan requires a minimum charge of 30 days of usage. For cancelation after 30 days, your monthly bill will be adjusted based on the number of days the service is activated."},{"name":"db2oncloud-large","description":"This plan comes with a Db2 Workgroup Server Edition license. It can be set up to use HADR (an additional server is required for HADR). It does not include advanced features such as adaptive row compression, BLU or DPF (Database Partitioning Feature). For a feature comparison of your Db2 edition, see http://ibm.biz/db2products. This plan requires a minimum charge of 30 days of usage. For cancelation after 30 days, your monthly bill will be adjusted based on the number of days the service is activated."},{"name":"db2oncloud-large-adv","description":"This plan comes with a Db2 Advanced Server Enterprise Edition license. It can be set up to use HADR (an additional server is required for HADR). It includes advanced features such as adaptive row compression, BLU and DPF (Database Partitioning Feature). For a feature comparison of your Db2 edition, see http://ibm.biz/db2products. This plan requires a minimum charge of 30 days of usage. For cancelation after 30 days, your monthly bill will be adjusted based on the number of days the service is activated."},{"name":"db2oncloud-medium","description":"This plan comes with a Db2 Workgroup Server Edition license. It can be set up to use HADR (an additional server is required for HADR). It does not include advanced features such as adaptive row compression, BLU or DPF (Database Partitioning Feature). For a feature comparison of your Db2 edition, see http://ibm.biz/db2products. This plan requires a minimum charge of 30 days of usage. For cancelation after 30 days, your monthly bill will be adjusted based on the number of days the service is activated."},{"name":"db2oncloud-medium-adv","description":"This plan comes with a Db2 Advanced Server Enterprise Edition license. It can be set up to use HADR (an additional server is required for HADR). It includes advanced features such as adaptive row compression, BLU and DPF (Database Partitioning Feature). For a feature comparison of your Db2 edition, see http://ibm.biz/db2products. This plan requires a minimum charge of 30 days of usage. For cancelation after 30 days, your monthly bill will be adjusted based on the number of days the service is activated."},{"name":"db2oncloud-small-adv","description":"This plan comes with a Db2 Advanced Server Enterprise Edition license. It can be set up to use HADR (an additional server is required for HADR). It includes advanced features such as adaptive row compression, BLU and DPF (Database Partitioning Feature). For a feature comparison of your Db2 edition, see http://ibm.biz/db2products. This plan requires a minimum charge of 30 days of usage. For cancelation after 30 days, your monthly bill will be adjusted based on the number of days the service is activated."},{"name":"db2oncloud-x-large","description":"This plan comes with a Db2 Workgroup Server Edition license. It can be set up to use HADR (an additional server is required for HADR). It does not include advanced features such as adaptive row compression, BLU or DPF (Database Partitioning Feature). For a feature comparison of your Db2 edition, see http://ibm.biz/db2products. This plan requires a minimum charge of 30 days of usage. For cancelation after 30 days, your monthly bill will be adjusted based on the number of days the service is activated. Because this is a bare metal server plan, an additional 14 days of notice is required before cancellation."},{"name":"db2oncloud-x-large-adv","description":"This plan comes with a Db2 Advanced Server Enterprise Edition license. It can be set up to use HADR (an additional server is required for HADR). It includes advanced features such as adaptive row compression, BLU and DPF (Database Partitioning Feature). For a feature comparison of your Db2 edition, see http://ibm.biz/db2products. This plan requires a minimum charge of 30 days of usage. For cancelation after 30 days, your monthly bill will be adjusted based on the number of days the service is activated. Because this is a bare metal server plan, an additional 14 days of notice is required before cancellation."},{"name":"db2oncloud-xx-large-adv","description":"This plan comes with a Db2 Advanced Server Enterprise Edition license. It can be set up to use HADR (an additional server is required for HADR). It includes advanced features such as adaptive row compression, BLU and DPF (Database Partitioning Feature). For a feature comparison of your Db2 edition, see http://ibm.biz/db2products. This plan requires a minimum charge of 30 days of usage. For cancelation after 30 days, your monthly bill will be adjusted based on the number of days the service is activated. Because this is a bare metal server plan, an additional 14 days of notice is required before cancellation."},{"name":"hdmp-flex","description":"Customers who currently hold an active subscription to the IBM Hybrid Data Management Platform are eligible to purchase the Db2 Hosted Hybrid Flex plan. This plan includes one service instance with 4GB RAM and 1 virtual processor core (VPC) on a dedicated virtual server. The base instance also provides 100GB of storage for data and logs. Deploys with an additional 100GB of storage reserved solely for the operating system. Scale compute and storage resources dynamically, which will be metered hourly and billed against your HDMP FlexPoint entitlement. To learn more or subscribe to the Hybrid Data Management Platform, please visit: https://ibm.biz/hybrid-data-management-marketplace-page. For existing customers, FlexPoint entitlements can be monitored and managed at: https://hybrid-cloud-usage-hub.mybluemix.net."},{"name":"small","description":"This plan comes with a Db2 Workgroup Server Edition license. It can be set up to use HADR (an additional server is required for HADR). It does not include advanced features such as adaptive row compression, BLU or DPF (Database Partitioning Feature). For a feature comparison of your Db2 edition, see http://ibm.biz/db2products. This plan requires a minimum charge of 30 days of usage. For cancelation after 30 days, your monthly bill will be adjusted based on the number of days the service is activated."}]},{"name":"difitek","id":"5b45fd07-d6cf-4596-b95e-2d3257267fd3","displayName":"Difitek","description":"API-first platform for fintech applications","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"directlink.dedicated","id":"dc11a440-6073-11e9-9f5a-2f7997ba23c0","displayName":"Direct Link Dedicated","description":"IBM Cloud Direct Link helps ensure the security of sensitive data to and from the IBM Cloud","planUpdateable":true,"plans":[{"name":"standard-plan---dl2","description":"Direct Link 2.0 Standard Plan"}]},{"name":"discovery","id":"76b7bf22-b443-47db-b3db-066ba2988f47","displayName":"Discovery","description":"Add a cognitive search and content analytics engine to applications.","planUpdateable":true,"plans":[{"name":"advanced","description":"The Advanced plan offers a variety of pricing options based on document tiers up to 100M documents. Higher tiers provide more resources that can enable higher performance. Custom models and news queries beyond Lite Plan limits are also available with Add-on pricing. For special requirements, please contact Sales. See documentation for details."},{"name":"lite","description":"The Lite plan is a great starter plan to trial features at no cost. With 1000 documents, 200 news queries, and 1 custom model, test-drive the service's foundational capabilities. When you upgrade to a paid plan, you'll keep any content you have ingested. See documentation for details."},{"name":"premium","description":"To purchase a premium plan, visit: https://ibm.biz/contact-wdc-premium"}]},{"name":"dns-svcs","id":"b4ed8a30-936f-11e9-b289-1d079699cbe5","displayName":"DNS Services","description":"Use DNS Services on VPC Private Networks to manage hostnames and IP addresses while limiting access to the DNS records from permitted networks only.","planUpdateable":true,"plans":[{"name":"free-plan","description":"Free Plan for DNS Services"}]},{"name":"dsoncloud","id":"dsonCloud_2EFEDAD7-63CB-46E6-8147-0E9AFFDB37FE","displayName":"Information Server","description":"IBM® Information Server on Cloud allows you to rapidly expand data integration and governance capabilities into the cloud for new or ad hoc development and testing environments.","planUpdateable":false,"plans":[{"name":"client","description":"The IBM Information Server Client. An additional client system which supports 2 additional concurrent users."},{"name":"ee-large-high-availability","description":"The IBM Information Server Enterprise Edition on Cloud High Availability Large plan provides for 10 concurrent users. The Information Server Enterprise Edition Engine and Services tiers are powered by two machines. The Engine tier machine has 12 cores of 2.0 GHz with 64 GB RAM and two SSD drives with 1.7 TB capacity in a RAID 1 configuration. The Service tier machine has 8 cores of 2.0 GHz with 32 GB RAM and two SSD drives with 960 GB capacity in a RAID 1 configuration."},{"name":"ee-large-premium","description":"The IBM Information Server Enterprise Edition on Cloud Premium Large plan provides for 10 concurrent users. The Information Server Enterprise Edition Engine and Services tiers are powered by two machines. The Engine tier machine has 12 cores of 2.0 GHz with 64 GB RAM and two SSD drives with 1.7 TB capacity in a RAID 1 configuration. The Service tier machine has 8 cores of 2.0 GHz with 32 GB RAM and two SSD drives with 960 GB capacity in a RAID 1 configuration."},{"name":"ee-medium-high-availability","description":"The IBM Information Server Enterprise Edition on Cloud High Availability Medium plan provides for five concurrent users. The Information Server Enterprise Edition Engine and Services tiers are powered by two machines each with eight cores of 2.0 GHz with 32 GB RAM and two SAN disks of 100 GB and 1000 GB capacity respectively."},{"name":"ee-medium-non-production","description":"The IBM Information Server Enterprise Edition on Cloud Non Production Medium plan provides for five concurrent users. The Information Server Enterprise Edition Engine and Services tiers are powered by two machines each with eight cores of 2.0 GHz with 32 GB RAM and two SAN disks of 100 GB and 1000 GB capacity respectively."},{"name":"ee-medium-premium","description":"The IBM Information Server Enterprise Edition on Cloud Premium Medium plan provides for five concurrent users. The Information Server Enterprise Edition Engine and Services tiers are powered by two machines each with eight cores of 2.0 GHz with 32 GB RAM and two SAN disks of 100 GB and 1000 GB capacity respectively."},{"name":"ee-small-high-availability","description":"The IBM Information Server Enterprise Edition on Cloud High Availability Small plan provides for two concurrent users. The Information Server Enterprise Edition Engine and Services tiers are powered by two machines each with four cores of 2.0 GHz with 16 GB RAM and two SAN disks of 100 GB and 500 GB capacity respectively."},{"name":"ee-small-non-production","description":"The IBM Information Server Enterprise Edition on Cloud Non Production Small plan provides for two concurrent users. The Information Server Enterprise Edition Engine and Services tiers are powered by two machines each with four cores of 2.0 GHz with 16 GB RAM and two SAN disks of 100 GB and 500 GB capacity respectively."},{"name":"ee-small-premium","description":"The IBM Information Server Enterprise Edition on Cloud Premium Small plan provides for two concurrent users. The Information Server Enterprise Edition Engine and Services tiers are powered by two machines each with four cores of 2.0 GHz with 16 GB RAM and two SAN disks of 100 GB and 500 GB capacity respectively."},{"name":"large-high-availability","description":"The IBM DataStage on Cloud High Availability Large plan provides for 10 concurrent users. The DataStage server is powered by two machines each with 12 cores of 2.0 GHz with 64 GB RAM and two SSD drives with 960 GB capacity each."},{"name":"large-premium","description":"The IBM DataStage on Cloud Premium Large plan provides for 10 concurrent users. The DataStage server is powered by two machines each with 12 cores of 2.0 GHz with 64 GB RAM and two SSD drives with 960 GB capacity each."},{"name":"medium-high-availability","description":"The IBM DataStage on Cloud High Availability Medium plan provides for five concurrent users. The DataStage server is powered by two machines each with eight cores of 2.0 GHz with 32 GB RAM and two SAN disks of 100 GB and 1000 GB capacity respectively."},{"name":"medium-non-production","description":"The IBM DataStage on Cloud Non Production Medium plan provides for five concurrent users. The DataStage server is powered by two machines each with eight cores of 2.0 GHz with 32 GB RAM and two SAN disks of 100 GB and 1000 GB capacity respectively."},{"name":"medium-premium","description":"The IBM DataStage on Cloud Premium Medium plan provides for five concurrent users. The DataStage server is powered by two machines each with eight cores of 2.0 GHz with 32 GB RAM and two SAN disks of 100 GB and 1000 GB capacity respectively."},{"name":"small-high-availability","description":"The IBM DataStage on Cloud High Availability Small plan provides for two concurrent users. The DataStage Server is powered by two machines each with four cores of 2.0 GHz with 16 GB RAM and two SAN disks of 100 GB and 500 GB capacity respectively."},{"name":"small-non-production","description":"The IBM DataStage on Cloud Non Production Small plan provides for two concurrent users. The DataStage Server is powered by two machines each with four cores of 2.0 GHz with 16 GB RAM and two SAN disks of 100 GB and 500 GB capacity respectively."},{"name":"small-premium","description":"The IBM DataStage on Cloud Premium Small plan provides for two concurrent users. The DataStage Server is powered by two machines each with four cores of 2.0 GHz with 16 GB RAM and two SAN disks of 100 GB and 500 GB capacity respectively."}]},{"name":"dwolla","id":"618c27d5-6f91-4615-baa1-9efb76e7814b","displayName":"Dwolla","description":"Dwolla is a powerful payments platform.","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"dynamic-dashboard-embedded","id":"81cda9f0-b9c3-11e7-acad-0d931c5f18f1","displayName":"IBM Cognos Dashboard Embedded","description":"Bring data to life directly from your application with this powerful and easy-to-use visualization service.","planUpdateable":true,"plans":[{"name":"lite","description":"A session is a 60 minute period where end-users can perform unlimited interactions with an embedded dashboard."},{"name":"paygo","description":"A session is a 60 minute period where end-users can perform unlimited interactions with an embedded dashboard."}]},{"name":"ecs-checker","id":"9cbc2ff1-ee54-44ca-bbff-c5dee9913cd8","displayName":"Digital Content Checker","description":"Automate accessibility verification of HTML and EPUB documents.","planUpdateable":false,"plans":[{"name":"ecs-checker-free","description":"Free usage for the service Experimental/Beta period"}]},{"name":"ecs-dashboard","id":"4ad9a593-2259-4956-ab94-ac0de564cfaa","displayName":"Automated Accessibility Tester","description":"Integrate automated accessibility auditing and reporting capabilities into your deployment DevOps processes.","planUpdateable":false,"plans":[{"name":"ecs-dashboard-free","description":"Free usage for the service Experimental/Beta period"}]},{"name":"envestnet---yodlee","id":"aad5c038-a44d-4a3e-b8c2-133ca3e2655b","displayName":"Envestnet | Yodlee","description":"APIs for Financial Data Aggregation","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"esql","id":"bc0e0f30-a061-11e8-9dfc-536f3b158609","displayName":"ElephantSQL","description":"PostgreSQL as a Service","planUpdateable":false,"plans":[{"name":"dolphin","description":"Dedicated server"},{"name":"elephant","description":"Dedicated server"},{"name":"hippo","description":"Dedicated server"},{"name":"lite","description":"Tiny Turtle - Shared high performance server"},{"name":"panda","description":"Shared high-performance server"},{"name":"pigeon","description":"Dedicated server"}]},{"name":"esri-arcgis-for-developers","id":"8c455b2d-79dc-45c3-8a31-c72b924ec833","displayName":"Esri ArcGIS for Developers","description":"Bring the power of location to your apps with ArcGIS.","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"exp","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-exp","displayName":"IBM Cloud Expert Services","description":"Engage Expert Services to work side-by-side with your internal team to plan the architecture, deployment, and migration of your IBM Cloud solution.","planUpdateable":false,"plans":[]},{"name":"fortigate","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-fortigate","displayName":"FortiGate Security Appliance","description":"Order and provision an HA-pair of FortiGate Security Appliance devices through IBM Cloud to protect your network.","planUpdateable":false,"plans":[]},{"name":"fortigatevm","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-fortigatevm","displayName":"FortiGate Virtual Appliance","description":"Optimize performance and ensure availability and security for applications with the Fortinet FortiGate-VM suite.","planUpdateable":false,"plans":[]},{"name":"fss-financial-optimization-service","id":"2a001640-21f1-466e-b6f0-d227c353a823","displayName":"Portfolio Optimization","description":"Construct or rebalance investment portfolios based on investor goals, mandates, and preferences.","planUpdateable":false,"plans":[{"name":"fss-financial-optimization-service-free-plan","description":"Portfolio Optimization Service Experimental Plan"}]},{"name":"fss-historical-instrument-analytics-service","id":"BE3AADC2-2C1A-4078-82F0-A33B1FD86EB0","displayName":"Historical Instrument Analytics","description":"Leverage sophisticated IBM Algorithmics financial models to price and evaluate financial securities for historical dates.","planUpdateable":false,"plans":[{"name":"fss-historical-instrument-analytics-service-free-plan","description":"Historical Instrument Analytics Experimental Plan"}]},{"name":"fss-historical-scenario-analytics-service","id":"ABB08BA3-D14D-4BD9-A5E6-EF67C52D35C0","displayName":"Simulated Historical Instrument Analytics","description":"Leverage sophisticated IBM Algorithmics financial models to price and compute analytics on financial securities for a historical date, under a scenario.","planUpdateable":false,"plans":[{"name":"fss-historical-scenario-analytics-service-free-plan","description":"Simulated Historical Instrument Analytics Experimental Plan"}]},{"name":"fss-instrument-analytics-service","id":"EEB04BA5-25BB-4E52-AAE5-9C7BEF86543B","displayName":"Instrument Analytics","description":"Leverage sophisticated IBM Algorithmics financial models to price and compute analytics on financial securities.","planUpdateable":false,"plans":[{"name":"fss-instrument-analytics-service-free-plan","description":"Instrument Analytics Experimental Plan"}]},{"name":"fss-portfolio-service","id":"3b960983-4483-488a-9851-6f7cccdb3534","displayName":"Investment Portfolio","description":"Maintain a record of your investment portfolios through time.","planUpdateable":false,"plans":[{"name":"fss-portfolio-service-free-plan","description":"Investment Portfolio Free Plan"}]},{"name":"fss-predictive-scenario-analytics-service","id":"C43B3EB0-F56B-4753-92E4-093815814C1E","displayName":"Predictive Market Scenarios","description":"Create conditional scenarios to model how, given a change to a subset of factors the broader set of market factors are expected to change.","planUpdateable":false,"plans":[{"name":"fss-predictive-scenario-analytics-service-free-plan","description":"Predictive Market Scenarios Experimental Plan"}]},{"name":"fss-scenario-analytics-service","id":"A888FFEA-E976-4F83-B7EC-288233BF62E6","displayName":"Simulated Instrument Analytics","description":"Leverage sophisticated IBM Algorithmics financial models to price and compute analytics on financial securities under a given scenario.","planUpdateable":false,"plans":[{"name":"fss-scenario-analytics-service-free-plan","description":"Simulated Instrument Analytics Experimental Plan"}]},{"name":"functions","id":"functions","displayName":"Functions","description":"IBM Cloud Functions is a Function-as-a-Service (FaaS) platform which executes functions in response to incoming events.","planUpdateable":false,"plans":[]},{"name":"fundingshield---wire-account-verification-service--wavs-","id":"9d788e08-1b4a-4504-920a-d2842b72f36d","displayName":"FundingShield - Wire Account Verification Service (WAVS)","description":"Wire fraud prevention and compliance confirmation","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"fusionauth","id":"7de32cac-4055-4166-92e8-b65baace7bca","displayName":"FusionAuth","description":"Modern Identity and User Management","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"g11n-pipeline","id":"6f6e0937-6110-42eb-8988-3a1999854d20","displayName":"Globalization Pipeline","description":"Manage the translation of your cloud and mobile applications using IBM Globalization Pipeline.","planUpdateable":true,"plans":[{"name":"professional","description":"You will be charged per instance, which includes unlimited basic machine translation in nine languages and 2 MB of storage. Additional storage available for an added monthly charge. Professional translation review and editing service for additional charge by word."},{"name":"standard","description":"You will be charged per instance, which includes unlimited basic machine translation in nine languages and 2 MB of storage. Additional storage available for an added monthly charge."}]},{"name":"geo-web-services","id":"f42f47a0-f793-4b45-ad11-782cc565df16","displayName":"GEO Web Services","description":"Adding geo-intelligence to your business.","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"hazardhub-property-risk-data-api","id":"1564e6bd-9b6c-44dd-8402-d3818d9664c5","displayName":"HazardHub Property Risk Data API","description":"Property Level hazard risk data","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"hcx","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-hcx","displayName":"HCX","description":"Extend the networks of your on-premises data centers into IBM Cloud, and migrate your VMs to or from IBM Cloud without any change.","planUpdateable":false,"plans":[]},{"name":"health-score","id":"0db0a19f-b20e-4a52-8cc7-2821a28c26b0","displayName":"Health Score","description":"The dacadoo Health Score measures health","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"horizon","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-horizon","displayName":"Horizon 7","description":"A seamlessly integrated hybrid cloud for virtual desktops and applications based on VMware Horizon® 7.","planUpdateable":false,"plans":[]},{"name":"hpcaas-from-rescale-prod","id":"1e754a80-62eb-11e8-8081-896abbd4f1e8","displayName":"HPCaaS from Rescale","description":"HPCaaS from Rescale enables you to rapidly deploy your HPC jobs on the IBM Cloud with your chosen execution environment.","planUpdateable":false,"plans":[{"name":"frankfurt-rescale-plan","description":"Multiple hardware configurations are available to run HPC workloads using Rescale ScaleX platform.  Each hardware configuration will have different associated costs per core hour of usage. The prices for Desktop and Software components are just the starting price, please check Rescale pricing for details of specific Desktop types and Software Packages for actual pricing that applies to your HPC workload."},{"name":"london-rescale-plan","description":"Multiple hardware configurations are available to run HPC workloads using Rescale ScaleX platform.  Each hardware configuration will have different associated costs per core hour of usage. The prices for Desktop and Software components are just the starting price, please check Rescale pricing for details of specific Desktop types and Software Packages for actual pricing that applies to your HPC workload."},{"name":"rescale-hardware-plan","description":"Multiple hardware configurations are available to run HPC workloads using Rescale ScaleX platform.  Each hardware configuration will have different associated costs per core hour of usage. The prices for Desktop and Software components are just the starting price, please check Rescale pricing for details of specific Desktop types and Software Packages for actual pricing that applies to your HPC workload."},{"name":"sydney-rescale-plan","description":"Multiple hardware configurations are available to run HPC workloads using Rescale ScaleX platform.  Each hardware configuration will have different associated costs per core hour of usage. The prices for Desktop and Software components are just the starting price, please check Rescale pricing for details of specific Desktop types and Software Packages for actual pricing that applies to your HPC workload."},{"name":"tokyo-rescale-plan","description":"Multiple hardware configurations are available to run HPC workloads using Rescale ScaleX platform.  Each hardware configuration will have different associated costs per core hour of usage. The prices for Desktop and Software components are just the starting price, please check Rescale pricing for details of specific Desktop types and Software Packages for actual pricing that applies to your HPC workload."}]},{"name":"hpvs","id":"986f2197-9f9a-44f4-9463-f17ec64c6729","displayName":"Hyper Protect Virtual Server","description":"Create and run virtual servers on IBM LinuxONE, the industry’s most secure Linux-based platform. With an SSH key pair under your control, you have complete authority over your sensitive workloads.","planUpdateable":false,"plans":[{"name":"entry","description":"Entry plan using 1 vCPU, 4 GB of memory and 100 GB of storage."},{"name":"lite-s","description":"Free plan using 1 vCPU, 2 GB of memory and 50 GB of storage. Free plan instances will be deleted after 30 days."},{"name":"medium","description":"Medium plan using 4 vCPUs, 16 GB of memory and 100 GB of storage."},{"name":"small","description":"Small plan using 2 vCPUs, 8 GB of memory and 100 GB of storage"}]},{"name":"hs-crypto","id":"d589492e-6ac0-4a11-9c28-a157851c8f68","displayName":"Hyper Protect Crypto Services","description":"Data protection with a dedicated key management service and hardware security module (HSM) - using FIPS 140-2 Level 4 certified hardware.","planUpdateable":false,"plans":[{"name":"standard","description":"The default number of crypto units is two for high availability within the region. You may choose additional units for greater performance. If you choose 1 crypto unit, please read the terms of the service to understand the different terms that apply to the service. The monthly charge for each provisioned crypto unit and API calls will be billed at a rate of $0.01 USD per 10,000 API calls over 1 million API calls."}]},{"name":"hydrogen","id":"bc16516d-4559-48ee-9d61-e4a51710104b","displayName":"Hydrogen","description":"Build fintech apps with ease with Hydrogen's APIs.","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"hyperp-dbaas-mongodb","id":"59a64cf0-5cf3-11e9-90a2-37a496589afc","displayName":"Hyper Protect DBaaS for MongoDB","description":"Hyper Protect DBaaS for MongoDB is a highly secured enterprise service. It provides capabilities to manage MongoDB through standardized interfaces.","planUpdateable":false,"plans":[{"name":"mongodb-free","description":"A MongoDB service instance consisting of one primary node and two secondary nodes for high availability within the region. Free plan instance will be deleted after 30 days."},{"name":"mongodb-large","description":"A MongoDB service instance consisting of one primary node and two secondary nodes for high availability within the region"},{"name":"mongodb-medium","description":"A MongoDB service instance consisting of one primary node and two secondary nodes for high availability within the region"},{"name":"mongodb-small","description":"A MongoDB service instance consisting of one primary node and two secondary nodes for high availability within the region"}]},{"name":"hyperp-dbaas-postgresql","id":"024d3260-5cf4-11e9-90a2-37a496589afc","displayName":"Hyper Protect DBaaS for PostgreSQL","description":"Hyper Protect DBaaS for PostgreSQL is a highly secured enterprise service. It provides capabilities to manage PostgreSQL through standardized interfaces.","planUpdateable":false,"plans":[{"name":"postgresql-free","description":"A PostgreSQL service instance consisting of one primary node and two secondary nodes for high availability within the region. Free plan instance will be deleted after 30 days."},{"name":"postgresql-large","description":"A PostgreSQL service instance consisting of one primary node and two secondary nodes for high availability within the region"},{"name":"postgresql-medium","description":"A PostgreSQL service instance consisting of one primary node and two secondary nodes for high availability within the region"},{"name":"postgresql-small","description":"A PostgreSQL service instance consisting of one primary node and two secondary nodes for high availability within the region"}]},{"name":"hytrust","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-hytrust","displayName":"IBM Cloud Secure Virtualization","description":"Protect your workloads and simplify compliance using IBM Cloud Secure Virtualization.","planUpdateable":false,"plans":[]},{"name":"hytrustcc","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-hytrustcc","displayName":"HyTrust CloudControl","description":"Provide automated protection and compliance support, enabling better visibility and control over your cloud environment and administrators.","planUpdateable":false,"plans":[]},{"name":"hytrustdc","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-hytrustdc","displayName":"HyTrust DataControl","description":"Protect your data with powerful encryption and scalable key management to secure your workloads throughout their lifecycles.","planUpdateable":false,"plans":[]},{"name":"hytrustkc","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-hytrustkc","displayName":"HyTrust KeyControl","description":"Provide scalable and highly available key management for your data security needs.","planUpdateable":false,"plans":[]},{"name":"ibm-blockchain-5-prod","id":"712b94a0-c4a7-48b5-a527-fd27908b9a8e","displayName":"Blockchain","description":"First version Starter and Enterprise Plans, soon to be deprecated. Search for the “Blockchain Platform” tile in the catalog to use the latest version of the platform.","planUpdateable":false,"plans":[{"name":"ibm-blockchain-plan-v1-ga1-prod","description":"The IBM Blockchain Platform is the only fully integrated blockchain platform designed to accelerate the development, governing, and operation of a multi-institution business network. Enterprise plan meets production requirements including security and performance for regulated industries."}]},{"name":"ibm-cloud-brokerage-cam","id":"76fad670-9d74-4138-8a14-709f5e6ac65b","displayName":"Cost and Asset Management","description":"Hybrid Cloud Cost and Asset management service broker","planUpdateable":false,"plans":[{"name":"experimental","description":"Cost Asset Management Service available on Bluemix as trial version for 90 days."}]},{"name":"ibmanalyticsengine","id":"18de078f-e6b0-4b47-a7c4-0ed2f93f3e1d","displayName":"Analytics Engine","description":"Flexible framework to deploy Hadoop and Spark analytics applications.","planUpdateable":true,"plans":[{"name":"lite","description":"Try IBM Analytics Engine for free to develop and test Spark and Hadoop workloads. The cluster is disabled after 50 node-hours. If you don't upgrade the service instance to a paid plan, the cluster will be deleted.\n\nNOTE: This plan is available only for institutions that have signed up with IBM for trying out Lite plan. See http://ibm.biz/BdztLK for details."},{"name":"standard-hourly","description":"Spin up clusters within minutes with a choice of software packs. Develop and deploy Spark and Hadoop workloads, including integration through IBM Watson Studio. This plan provides an hourly consumption model that is suitable for on-demand scaling and intermittent usage.\n\nHIPAA readiness option available in the Dallas region.\n\nFor HIPAA support, you must enable it in your IBM Cloud account settings. For instructions, go to \"https://cloud.ibm.com/docs/services/AnalyticsEngine/hipaa-readiness.html#hipaa-readiness\""},{"name":"standard-monthly","description":"Spin up clusters within minutes with a choice of software packs. Develop and deploy Spark and Hadoop workloads, including integration through IBM Watson Studio. This plan provides a monthly consumption model that is suitable for predictable, long running usage and scaling in periods of minimum 1 month.\n\nHIPAA readiness option available in the Dallas  region.\n\nFor HIPAA support, you must enable it in your IBM Cloud account settings. For instructions, go to \"https://cloud.ibm.com/docs/services/AnalyticsEngine/hipaa-readiness.html#hipaa-readiness\""}]},{"name":"icp","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-icp","displayName":"IBM Cloud Private Hosted","description":"Bring together the power of containerized IBM software, Kubernetes, and VMware to your VMware environment in the IBM Cloud.","planUpdateable":false,"plans":[]},{"name":"imfpush","id":"Push-d6aece47-d840-45b0-8ab9-ad15354deeea","displayName":"Push Notifications","description":"Scalable and reliable Push Notifications service for mobile and web applications","planUpdateable":true,"plans":[{"name":"advanced","description":"A push notification sent to a unique device/end point or a webhook event constitutes a digital message. An Addressable Device is a device upon which an application is  installed that is addressable by the Cloud Service."},{"name":"basic","description":"A push notification sent to a unique device/end point or a webhook event constitutes a digital message. An Addressable Device is a device upon which an application is  installed that is addressable by the Cloud Service. If upgrading from Lite Plan, you will be charged post 1 million digital messages starting from the current count where the lite plan usage was clipped"},{"name":"lite","description":"A push notification sent to a unique device/end point or a webhook event constitutes a digital message. An Addressable Device is a device upon which an application is  installed that is addressable by the Cloud Service."}]},{"name":"imi","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-imi","displayName":"Managed VMware Services","description":"Enable IBM Integrated Managed VMware services to deliver dynamic remote management services for a broad range of cloud infrastructures.","planUpdateable":false,"plans":[]},{"name":"influxcloud","id":"1f9be306-ada9-4be4-8220-b666668d9ca0","displayName":"InfluxCloud","description":"A modern time series data platform for metrics & events","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"informix-on-cloud","id":"84a429f4-a2f2-40e3-b155-29242c8f5141","displayName":"Informix","description":"IBM Informix on Cloud helps businesses gain a trusted view of data in a hybrid computing environment.","planUpdateable":false,"plans":[{"name":"large","description":"IBM Informix on Cloud Large plan gives you an Informix server that is installed into a virtual server configuration.  The Large plan is suitable for production or pre-production operations. This plan requires a minimum charge of 30 days of usage. After the initial 30 days you may cancel any time, however you will be billed for usage until the end of that month."},{"name":"large-via-sales","description":"IBM Informix on Cloud Large plan gives you an Informix server that is installed into a virtual server configuration.  The Large plan is suitable for production or pre-production operations. Contact IBM Sales for detailed sizings."},{"name":"medium","description":"IBM Informix on Cloud Medium plan gives you an Informix server that is installed into a virtual server configuration.  The Medium plan is suitable for development, customization, and functional testing operations. This plan requires a minimum charge of 30 days of usage. After the initial 30 days you may cancel any time, however you will be billed for usage until the end of that month."},{"name":"medium-via-sales","description":"IBM Informix on Cloud Medium plan gives you an Informix server that is installed into a virtual server configuration.  The Medium plan is suitable for development, customization, and functional testing operations. Contact IBM Sales for detailed sizings."},{"name":"small","description":"IBM Informix on Cloud Small plan gives you an Informix server that is installed into a virtual server configuration.  The Small plan is suitable for development, customization, and functional testing operations. This plan requires a minimum charge of 30 days of usage. After the initial 30 days you may cancel any time, however you will be billed for usage until the end of that month."},{"name":"small-via-sales","description":"IBM Informix on Cloud Small plan gives you an Informix server that is installed into a virtual server configuration.  The Small plan is suitable for development, customization, and functional testing operations. Contact IBM Sales for detailed sizings."},{"name":"xl","description":"IBM Informix on Cloud Extra Large plan gives you an Informix server that is installed on bare metal hardware.  The Extra Large plan is suitable for production operations. This plan requires a minimum charge of 30 days of usage. After the initial 30 days you may cancel any time, however you will be billed for usage until the end of that month."},{"name":"xl-via-sales","description":"IBM Informix on Cloud Extra Large plan gives you an Informix server that is installed on bare metal hardware.  The Extra Large plan is suitable for production operations. Contact IBM Sales for detailed sizings."}]},{"name":"internet-svcs","id":"75874a60-cb12-11e7-948e-37ac098eb1b9","displayName":"Internet Services","description":"Using Cloudflare, Cloud Internet Services (CIS) provides Domain Name Service (DNS), Global Load Balancer (GLB), DDoS protection, Web Application Firewall (WAF), Transport Layer Security (TLS), Rate Limiting, Smart Routing, and Caching.","planUpdateable":true,"plans":[{"name":"enterprise-package","description":"Cloud Internet Services Enterprise Package Plan"},{"name":"enterprise-usage","description":"Cloud Internet Services Enterprise Usage Plan"},{"name":"global-load-balancer","description":"IBM Cloud Internet Services Global Load Balancer Plan"},{"name":"security","description":"Cloud Internet Services Security Plan"},{"name":"standard","description":"Cloud Internet Services Standard Plan"},{"name":"trial","description":"Cloud Internet Services Free 30 day Trial"}]},{"name":"iotf-service","id":"iotf-service-id","displayName":"Internet of Things Platform","description":"This service is the hub of all things IBM IoT, it is where you can set up and manage your connected devices so that your apps can access their live and historical data.","planUpdateable":true,"plans":[{"name":"iotf-service-free","description":"The Lite service plan for Internet of Things Platform includes up to 500 registered devices, and a maximum of 200 MB each of data exchanged, data analyzed, and edge data analyzed per month."},{"name":"iotf-service-iotcs1","description":"Provisioning for the Capacity Level 1 plan can take up to 3 business days.  When ready, you will receive a welcome email with instructions on how to access your instance"},{"name":"iotf-service-iotcs2","description":"Provisioning for the Capacity Level 2 plan can take up to 3 business days.  When ready, you will receive a welcome email with instructions on how to access your instance"}]},{"name":"is.floating-ip","id":"is.floating-ip","displayName":"Floating IP for VPC","description":"Reserve a Floating IP that gives your virtual servers access to the Internet.","planUpdateable":false,"plans":[{"name":"default-nextgen","description":"Floating IP for VPC Standard Plan"},{"name":"gen1-floating-ip","description":"Floating IP Standard Plan"}]},{"name":"is.image","id":"is.image","displayName":"Image Service for VPC","description":"Image Service for VPC provides capabilities for customers to bring their own images or create images for rapid deployment","planUpdateable":false,"plans":[{"name":"gen1-image","description":"Plan for VPC Custom Images"},{"name":"gen2-image","description":"Pricing Plan for VPC Custom Images"}]},{"name":"is.instance","id":"is.instance","displayName":"Virtual Server for VPC","description":"Virtual Server instances for VPC deliver flexible compute capacity for your Virtual Private Cloud. Fully integrated into IBM Cloud platform and capable of provisioning faster than ever, our new Virtual Servers for VPC deliver better performance and a significantly enhanced user experience.","planUpdateable":false,"plans":[{"name":"advanced-vsi","description":"Pricing plan for Advanced VSIs"},{"name":"gen2-instance-power","description":"Pricing plan for Advanced VSIs on POWER"},{"name":"standard-vsi","description":"Pricing plan for VSIs"}]},{"name":"is.key","id":"556153d0-5ad0-11e9-b7f9-41319ef22125","displayName":"SSH Key for VPC","description":"SSH Key for use with VPC","planUpdateable":false,"plans":[{"name":"free-key-plan","description":"SSH Keys Free Plan"},{"name":"free-key-plan-nextgen","description":"SSH Keys Free Plan"}]},{"name":"is.load-balancer","id":"is.load-balancer","displayName":"Load Balancer for VPC","description":"Elastic Load Balancer as a service with core load balancing features and flexible usage-based pricing.","planUpdateable":true,"plans":[{"name":"gen1-load-balancer","description":"Standard Plan of Load Balancer for Virtual Private Cloud"},{"name":"gen2-load-balancer","description":"Standard Plan of Load Balancer for Virtual Private Cloud (NG)"},{"name":"gen2-load-balancer-beta","description":"Beta Plan of Load Balancer for Virtual Private Cloud (NG)"}]},{"name":"is.network-acl","id":"is.network-acl","displayName":"Network ACL","description":"Network ACL for VPC","planUpdateable":false,"plans":[{"name":"nextgen-network-acl-free","description":"Network ACL for VPC Standard plan for Gen2"}]},{"name":"is.public-gateway","id":"is.public-gateway","displayName":"Public Gateway for VPC","description":"Public Gateway for VPC","planUpdateable":false,"plans":[{"name":"nextgen-public-gateway-free","description":"Public Gateway"},{"name":"public-gateway-free","description":"Public Gateway Free Plan"}]},{"name":"is.security-group","id":"is.security-group","displayName":"Security Group for VPC","description":"Security Group for VPC","planUpdateable":false,"plans":[{"name":"nextgen-security-groups-free","description":"Security Groups for VPC Standard plan for Gen2"},{"name":"standard","description":"Security Groups for VPC Standard plan for Gen1"}]},{"name":"is.subnet","id":"is.subnet","displayName":"Subnet","description":"Subnet for VPC","planUpdateable":false,"plans":[{"name":"nextgen-subnet-free","description":"Subnet for VPC Standard Plan (Free)"},{"name":"subnet-free","description":"Subnet for VPC Standard Plan (Free)"}]},{"name":"is.volume","id":"is.volume","displayName":"Block Storage for VPC","description":"Persistent storage for use as boot and data storage for  Virtual Servers in a VPC network.","planUpdateable":false,"plans":[{"name":"10iops-tier","description":"Storage provisioned with 10 IOPS per GB for \nMost Demanding workloads such as analytics, big data, NoSQL databases, machine learning, and video processing."},{"name":"custom-","description":"Custom IOPS allows users to specify the IOPS they want to assign to their storage.  They are charged based on both provisioned IOPS and GB on an hour basis until the storage is deleted."},{"name":"gen1-volume-5iops-tier","description":"Storage provisioned with  5 IOPS per GB is charged per GB provisioned on an hourly basis based until the storage is deleted."},{"name":"gen2-volume-10iops-tier","description":"Storage provisioned with  10 IOPS per GB is charged per GB provisioned on an hourly basis based until the storage is deleted."},{"name":"gen2-volume-5iops-tier","description":"Storage provisioned with  5 IOPS per GB is charged per GB provisioned on an hourly basis based until the storage is deleted."},{"name":"gen2-volume-custom","description":"Custom IOPS allows users to specify the IOPS they want to assign to their storage.  They are charged based on both provisioned IOPS and GB on an hour basis until the storage is deleted."},{"name":"gen2-volume-general-purpose","description":"General purpose tier delivering 3 IOPS/GB and charged per GB of storage provisioned by the hour until the storage is deleted."},{"name":"general-purpose","description":"General purpose tier delivering 3 IOPS/GB for General Purpose workloads such as boot volumes, interactive applications, and dev/test."}]},{"name":"is.vpc","id":"is.vpc","displayName":"Virtual Private Cloud","description":"Fully customizable, software-defined virtual network with superior isolation.","planUpdateable":false,"plans":[{"name":"-vpc-egress-data-transfer","description":"Virtual Private Cloud Standard Plan"},{"name":"nextgen-egress","description":"Virtual Private Cloud Standard Plan"}]},{"name":"is.vpn","id":"is.vpn","displayName":"VPN for VPC","description":"VPN for VPC provides a simple yet powerful solution for highly scalable and robust site-to-site VPN. This VPN service provides a mixture of industry standard security and encryption options as well as support for Pre-shared Key authentication. The service also provides the ability to quickly add and remove VPN connections with the option to use pre-defined configurations.","planUpdateable":true,"plans":[{"name":"gen1-vpn","description":"Standard Plan for VPN for VPC"},{"name":"gen2-vpn","description":"Standard Plan for VPN for VPC"},{"name":"gen2-vpn-beta","description":"VPN for VPC beta pricing plan is used for beta to VPN service for VPC."}]},{"name":"kmipadapter","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-kmipadapter","displayName":"KMIP for VMware","description":"Cloud-based security service that provides life cycle management for encryption keys that are used in IBM Cloud services or customer-built applications.","planUpdateable":false,"plans":[]},{"name":"kms","id":"ee41347f-b18e-4ca6-bf80-b5467c63f9a6","displayName":"Key Protect","description":"An app-independent service for protecting, managing, and generating keys.","planUpdateable":false,"plans":[{"name":"tiered-pricing","description":"First 20 keys are free. Then after that it's $0.75 per key per month for up to 1,000 more keys. Then after that it's $0.60 per key per month for up to 9,000 more keys. Then after that it's $0.50 per key per month for each additional key."}]},{"name":"knowledge-studio","id":"983ea9a2-0fec-4021-8b70-8da5373394e5","displayName":"Knowledge Studio","description":"Teach Watson the language of your domain.","planUpdateable":true,"plans":[{"name":"free","description":"Try Watson Knowledge Studio for an unlimited time at no cost."},{"name":"premium","description":"To purchase a Premium plan, visit: https://ibm.biz/contact-wdc-premium"},{"name":"standard","description":"This plan operates in a multi-tenant environment, which offers cost efficiency to professionals working independently or in small groups."}]},{"name":"language-translator","id":"f1faf010-4107-4877-a571-fc9c8763c3dd","displayName":"Language Translator","description":"Translate text, documents, and websites from one language to another. Create industry or region-specific translations via the service's customization capability.","planUpdateable":true,"plans":[{"name":"advanced","description":"Base models are charged at the standard rate, usage of custom models incur additional charges."},{"name":"lite","description":"The Lite plan gets you started with 1,000,000 characters per month at no cost and includes the default translation models. When you upgrade to a paid plan, you can create custom models."},{"name":"premium","description":"To purchase a premium plan, visit: https://ibm.biz/contact-wdc-premium"},{"name":"standard","description":"Includes base translation models, custom models are not included in the standard plan.  Your first 250,000 characters are free. "}]},{"name":"lift-cli","id":"088b5af6-3075-4b8c-a211-66ff2ef38fb1","displayName":"Lift CLI","description":"Migrate your data quickly, easily and securely from your on-premises data source to an IBM Cloud data property.","planUpdateable":false,"plans":[{"name":"lift-starter-rc","description":"The plan provides you with data migrated inbound FREE of charge."}]},{"name":"logdna","id":"e13e1860-959c-11e8-871e-ad157af61ad7","displayName":"IBM Log Analysis with LogDNA","description":"LogDNA provides log collection and log search for IBM Log Analysis. Define alerts and design custom views to monitor application and system logs.","planUpdateable":true,"plans":[{"name":"14-day","description":"Logs are stored and searchable for 14 days.  Alert events in real time.  Archive.  Live streaming tail."},{"name":"30-day","description":"Logs are stored and searchable for 30 days.  Alert events in real time.  Archive.  Live streaming tail."},{"name":"7-day","description":"Logs are stored and searchable for 7 days.  Alert events in real time.  Archive.  Live streaming tail."},{"name":"lite","description":"Live Streaming Tail support with ability to build and save views in the UI. Logs are not retained for search. No Data Volume Limit.\nYou may upgrade your plan at any time after the initial set up."}]},{"name":"logdnaat","id":"dcc46a60-e13b-11e8-a015-757410dab16b","displayName":"IBM Cloud Activity Tracker with LogDNA","description":"LogDNA provides collection and search of events that occur on IBM Cloud Activity Tracker. Save searches, design alerts, and build graphs to monitor user activities.","planUpdateable":true,"plans":[{"name":"14-day","description":"Events are stored and searchable for 14 days.  Alert events in real time.  Archive.  Live streaming tail."},{"name":"30-day","description":"Events are stored and searchable for 30 days.  Alert events in real time.  Archive.  Live streaming tail."},{"name":"7-day","description":"Events are stored and searchable for 7 days.  Alert events in real time.  Archive.  Live streaming tail."},{"name":"lite","description":"Live Streaming Tail support with ability to build and save views in the UI. Events are not retained for search. No Data Volume Limit. \nYou may upgrade your plan at any time after the initial set up."}]},{"name":"managedveeam","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-managedveeam","displayName":"Managed Backup Services","description":"Deploy a fully-managed backup environment leveraging Veeam and IBM Resiliency Services.","planUpdateable":false,"plans":[]},{"name":"managedzerto","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-managedzerto","displayName":"Managed Disaster Recovery Services","description":"Deploy a fully-managed Disaster Recovery environment leveraging Zerto and IBM Resiliency Services.","planUpdateable":false,"plans":[]},{"name":"mass-data-migration","id":"3c1472b0-6b8b-11e9-a537-057f51269323","displayName":"Mass Data Migration","description":"A fast, simple, secure way to physically transfer terabytes to petabytes of data to the IBM Cloud","planUpdateable":false,"plans":[{"name":"mass-data-migration-pricing-plan","description":"Mass Data Migration Standard pricing plan"}]},{"name":"mcv","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-mcv","displayName":"IBM Cloud for VMware Mission Critical Workloads","description":"Deploy a fully-managed service delivered by IBM Services, which provides greater availability, resiliency, and support for enterprise mission critical applications.","planUpdateable":false,"plans":[]},{"name":"mdmoncloud","id":"mdmonCloud_2EFEDAD7-63CB-46E6-8147-0E9AFFDB37FE","displayName":"Master Data Management","description":"IBM® Master Data Management (MDM) on Cloud helps businesses gain a trusted view of data in a hybrid computing environment.","planUpdateable":false,"plans":[{"name":"additional-client","description":"Additional Client provides a Windows client for MDM on Cloud Non-Production environment. This instance is in addition to the two Windows client instances already available by default with the Non-Production Plan. For example, the Additional Client Plan enables you to add one or more Windows client to the two Windows clients provisioned with the Non-Production plan."},{"name":"additional-mdm-developer-and-test-environment","description":"IBM Master Data Management on Cloud Additional MDM Developer and Test Environment."},{"name":"large-high-availability","description":"The Master Data Management on Cloud High Availability Large plan offers MDM installed into a bare metal server configuration and is suitable as a production or pre-production operational MDM hub."},{"name":"large-premium","description":"The Master Data Management on Cloud Large plan offers MDM installed into a bare metal server configuration and is suitable as a production or pre-production operational MDM hub."},{"name":"medium-high-availability","description":"The Master Data Management on Cloud High Availability Medium plan offers MDM installed into a virtual server configuration and is suitable as a production or pre-production operational MDM hub."},{"name":"medium-premium","description":"The Master Data Management on Cloud Premium Medium plan offers MDM installed into a virtual server configuration and is suitable as a production or pre-production operational MDM hub."},{"name":"non-production","description":"The IBM Master Data Management on Cloud Non-Production plan offers MDM installed into a virtualized environment and is suitable as an environment for development, customization, and functional testing of the MDM hub and related processes. The IBM Master Data Management on Cloud Non-Production plan includes two shared non-production MDM runtime instances: one for development integration testing, and a second for quality assurance (QA) testing. The instance also includes two MDM developer instances, and two business process management (BPM) developer instances."},{"name":"small-high-availability","description":"The Master Data Management on Cloud High Availability Small plan offers MDM installed into a virtual server configuration and is suitable as a production or pre-production operational MDM hub."},{"name":"small-premium","description":"The Master Data Management on Cloud Premium Small plan offers MDM installed into a virtual server configuration and is suitable as a production or pre-production operational MDM hub."}]},{"name":"messagehub","id":"6a7f4e38-f218-48ef-9dd2-df408747568e","displayName":"Event Streams","description":"IBM Event Streams is a high-throughput message bus built with Apache Kafka. It is optimized for event ingestion into IBM Cloud and event stream distribution between your services and applications.","planUpdateable":true,"plans":[{"name":"enterprise-3nodes-2tb","description":"Provisioning for the Enterprise Plan will take up to 3 hours. For information about the capacity of the Enterprise Plan, please see 'choosing your plan' in our documentation."},{"name":"lite","description":"The Lite plan offers access to a single partition in a multi-tenant Event Streams cluster."},{"name":"standard","description":"If you are looking for our Lite Plan, please change your region to Dallas."}]},{"name":"compose-for-rabbitmq","id":"ComposeRabbitMQ-P","displayName":"Compose for RabbitMQ","description":"RabbitMQ is an open source multi-protocol messaging broker. Consider using our next generation service, Messages for RabbitMQ.","planUpdateable":false,"plans":[{"name":"enterprise","description":"The Enterprise plan allows the database service to be provisioned within an IBM Compose Enterprise cluster. This is a service which provides a private, dedicated and isolated cluster for customers. To use this plan, a Compose Enterprise cluster has to have been provisioned through the IBM Compose Enterprise service. The database service itself is billed at the shown rates."},{"name":"standard","description":"One database instance on a Compose cluster. Starts with 256MB Storage and scales automatically with your data."}]},{"name":"messages-for-rabbitmq","id":"messages-for-rabbitmq","displayName":"Messages for RabbitMQ","description":"RabbitMQ is an open source multi-protocol messaging broker.","planUpdateable":false,"plans":[{"name":"standard","description":"One highly available RabbitMQ instance with three data members. The Standard plan is priced based on disk storage, RAM, backup storage, and vCPUs allocated to deployments, prorated hourly. Messages for RabbitMQ instances have a minimum of 1GB of Disk and 1GB of RAM per data member. Dedicated cores can optionally be provisioned at a minimum of 3 cores per member."}]},{"name":"mobile-foundation","id":"0f8ae94c-7a2e-4a2d-8603-3ed12f890211","displayName":"Mobile Foundation","description":"Build secure, cognitive, engaging and personalized mobile apps faster at scale","planUpdateable":true,"plans":[{"name":"developer","description":"This plan provisions Mobile Foundation as a Liberty For Java application on IBM Cloud and offers Mobile Analytics at no charge with events retained for 6 months.  Liberty for Java usage is billed separately and is not included in this plan."},{"name":"professional1application","description":"This plan allows users to build, test and run mobile apps on Mobile Foundation in production with a predictable price regardless of the number of users or devices. Mobile Analytics is offered at no additional charge with events retained for 6 months. As part of this plan, Mobile Foundation requires users to have an instance of DB2 or Compose for PostgreSQL service on IBM Cloud, which is created and billed separately. This plan provisions Mobile Foundation as a Liberty for Java application on IBM Cloud starting with a minimum of 2 nodes of 1GB. Liberty for Java charges are billed separately and is not included in this plan."},{"name":"professionalperdevice","description":"This plan allows users to build, test and run up to 5 mobile apps on Mobile Foundation in production. Mobile Analytics is offered at no additional charge with events retained for 6 months. As part of this plan, Mobile Foundation requires users to have an instance of DB2 or Compose for PostgreSQL service on IBM Cloud, which is created and billed separately. This plan provisions Mobile Foundation as a Liberty for Java application on IBM Cloud starting with a minimum of 2 nodes of 1GB. Liberty for Java charges are billed separately and is not included in this plan."}]},{"name":"morningstar","id":"8e8d12b7-cee7-4c35-90d7-582ffef56f5a","displayName":"Morningstar","description":"Managed investments portfolio statistics","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"mqcloud","id":"01037c41-adce-4bb5-8b45-0c06004916c4","displayName":"MQ","description":"Enterprise-grade messaging hosted in the cloud","planUpdateable":true,"plans":[{"name":"custom","description":"A prepaid monthly subscription plan for customers who have made a purchase through an IBM sales representative. Usage above the contract entitlement will incur overage charges."},{"name":"default","description":"Charging will only start when you have provisioned your first queue manager."},{"name":"lite","description":"A no-charge plan to enable you to get started with the IBM MQ service on cloud today, for free!"}]},{"name":"natural-language-classifier","id":"8e17eb6f-6e2a-4b33-95ef-83bffe0833f7","displayName":"Natural Language Classifier","description":"Natural Language Classifier uses advanced natural language processing and machine learning techniques to create custom classification models. Users train their data and the service predicts the appropriate category for the inputted text.","planUpdateable":false,"plans":[{"name":"standard","description":"You will be charged per API call, per Classifier, and per training event"}]},{"name":"natural-language-generation-apis","id":"5932737c-e24b-4836-9e37-d8cead922316","displayName":"Natural Language Generation APIs","description":"Generate expertly written narratives in seconds","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"natural-language-understanding","id":"bb6393bc-7d81-446b-9728-61b704f6eca5","displayName":"Natural Language Understanding","description":"Analyze text to extract meta-data from content such as concepts, entities, emotion, relations, sentiment and more.","planUpdateable":true,"plans":[{"name":"free","description":"The Lite plan gets you started with 30,000 NLU Items per month at no cost. This plan also enables use of one custom model published through Watson Knowledge Studio."},{"name":"premium-tier1","description":"For more info or to purchase a premium plan, contact us at https://ibm.biz/contact-wdc-premium"},{"name":"standard","description":"This plan allows unlimited NLU Items and adds the ability to use multiple custom models published through Watson Knowledge Studio."}]},{"name":"netapp","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-netapp","displayName":"NetApp ONTAP Select","description":"Software-defined storage cluster that addresses your needs for a dedicated and highly available storage appliance based on NetApp ONTAP Select.","planUpdateable":false,"plans":[]},{"name":"nexmo","id":"3f5debff-044f-4292-b387-9c9a50ba81fe","displayName":"Nexmo","description":"Build great communication experiences.","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"openshift","id":"openshift","displayName":"Red Hat OpenShift on IBM Cloud","description":"Deploy and secure enterprise workloads on native OpenShift with developer focused tools to run highly available apps. OpenShift clusters build on Kubernetes container orchestration that offers consistency and flexibility in operations.","planUpdateable":true,"plans":[]},{"name":"pagerduty","id":"2d4c7a4d-2a2d-433f-a38d-9ebff43de337","displayName":"PagerDuty","description":"Incident Management and Resolution Platform","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"payeezy","id":"9e0b569e-03d7-44e4-a68c-6f567689a260","displayName":"Payeezy","description":"Simple, powerful payments","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"personality-insights","id":"d6d20106-cf62-4dcf-8dd9-d27ae0f36e55","displayName":"Personality Insights","description":"The Watson Personality Insights derives insights from transactional and social media data to identify psychological traits.","planUpdateable":true,"plans":[{"name":"lite","description":"The Lite plan gets you started with 1,000 API calls per month at no cost."},{"name":"premium","description":"To purchase a premium plan, visit: https://ibm.biz/contact-wdc-premium"},{"name":"tiered","description":"The plan for IBM Watson Personality Insights charges you for each call to the profile API."}]},{"name":"phunware-location-based-services","id":"2f2c407b-0a0d-4c57-8d8e-31bc7707d561","displayName":"Phunware Location Based Services","description":"Phunware Location Based Services","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"phunware-mobile-marketing-automation","id":"880fa4f0-62bc-48dc-8388-b4458f3f310c","displayName":"Phunware Mobile Marketing Automation","description":"Phunware Mobile Marketing Automation","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"plaid","id":"355f6faf-833f-4fcb-8ce9-f75c9954b2f0","displayName":"Plaid","description":"Innovate in financial services.","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"pm-20","id":"51c53b72-918f-4869-b834-2d99eb28422a","displayName":"Machine Learning","description":"IBM Watson Machine Learning - make smarter decisions, solve tough problems, and improve user outcomes.","planUpdateable":true,"plans":[{"name":"lite","description":"The lite plan instance of the IBM Watson Machine Learning service provides you with a maximum of 5 deployed models, 5,000 predictions per month, and 50 capacity unit-hours per month during which model can be trained, evaluated, and deployed to be available to accept prediction events, with a minimum of 1 minute per training job."},{"name":"professional","description":"The professional plan instance of the IBM Watson Machine Learning service is billed fixed amount per month, includes 2,000,000 predictions and 1,000 capacity unit-hours, with a minimum of 1 minute per training job. Overage is charged flat rate per each thousand of predictions and per each capacity unit-hour. For HIPAA support, you must enable it in your IBM Cloud account settings. For instructions, go to https://dataplatform.cloud.ibm.com/docs/content/getting-started/security.html#hipaa"},{"name":"standard","description":"The standard plan instance of the IBM Watson Machine Learning service charges flat rate per each thousand of predictions and per total number of capacity unit-hours, with a minimum of 1 minute per training job."}]},{"name":"portworx","id":"d666f360-66d1-11e9-85ef-a19427301a8c","displayName":"Portworx Enterprise","description":"Cloud-native persistent storage and data management solution for Kubernetes and OpenShift clusters.","planUpdateable":false,"plans":[{"name":"px-enterprise","description":"Cloud native storage solution for production workloads"}]},{"name":"power-iaas","id":"abd259f0-9990-11e8-acc8-b9f54a8f1661","displayName":"Power Systems Virtual Server","description":"Power Systems Virtual Server projects deliver flexible compute capacity built upon the advanced RAS features and leading performance of the Power Systems platform","planUpdateable":false,"plans":[{"name":"power-virtual-server-group","description":"A Power Systems Virtual Server group for the specified IBM Cloud region."}]},{"name":"powerlytics-behavior-propensity-model-api","id":"3702343d-a294-46e4-bfdd-6bdeb422a492","displayName":"Powerlytics Behavior/Propensity Model API","description":"Improve customer behavior/propensity models","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"powerlytics-consumer-income-api","id":"d846d490-ef88-44a1-822e-9d7f4d40a907","displayName":"Powerlytics Consumer Income API","description":"The income profile of consumers at the ZIP+4 level","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"powerlytics-investable-assets---wealth-api","id":"43a3d18e-847e-4c27-807f-3b509613612b","displayName":"Powerlytics Investable Assets & Wealth API","description":"Investable assets & wealth income at Zip+4 level.","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"precision-location","id":"efc44e05-4faa-43f2-a8a3-4795f31ddfa5","displayName":"Precision Location","description":"Skyhook Precision Location","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"quovo","id":"bc1f8800-0ee2-43ca-864b-1e29ce4fd8fd","displayName":"Quovo","description":"Connecting You to Your Users' Financial Accounts","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"rainbow","id":"135ead7e-cc70-4f10-8f2c-6e6c6821ce61","displayName":"Rainbow","description":"Connect people and transform the way they work","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"raxak-protect","id":"cf5f8ac0-98f7-11e9-a40c-5b3c4bf3cc6d","displayName":"Raxak Protect","description":"Automated Comprehensive Security Configuration Management for Servers","planUpdateable":false,"plans":[{"name":"lite","description":"Trial plan for initial demonstration purposes only."},{"name":"unlimited","description":"This plan allows you to have any number of resources simultaneously enrolled in the Raxak Protect managed security configuration service. You can downgrade the plan to any other paid plan without losing access to the enrolled resources as long as the number of enrolled resources does not conflict with the new plan capacity."},{"name":"upto10","description":"This plan allows you to have up to 10 resources simultaneously enrolled in the Raxak Protect managed security configuration service. You can change the plan to any other paid plan without losing access to the enrolled resources as long as the number of enrolled resources does not conflict with the plan capacity."},{"name":"upto100","description":"This plan allows you to have up to 100 resources simultaneously enrolled in the Raxak Protect managed security configuration service. You can change the plan to any other paid plan without losing access to the enrolled resources as long as the number of enrolled resources does not conflict with the new plan capacity."},{"name":"upto50","description":"This plan allows you to have up to 50 resources simultaneously enrolled in the Raxak Protect managed security configuration service. You can change the plan to any other paid plan without losing access to the enrolled resources as long as the number of enrolled resources does not conflict with the new plan capacity."},{"name":"upto500","description":"This plan allows you to have up to 500 resources simultaneously enrolled in the Raxak Protect managed security configuration service. You can change the plan to any other paid plan without losing access to the enrolled resources as long as the number of enrolled resources does not conflict with the new plan capacity."}]},{"name":"real-time-payments-service","id":"467ab6d8-48dd-485a-adf9-30d5107537a1","displayName":"Real-Time Payments","description":"Manage participants, tokens and recipients, and initiate and receive real time payments.","planUpdateable":false,"plans":[{"name":"real-time-payments-service-free-plan","description":"Real-Time Payments Experimental Plan"}]},{"name":"relsci","id":"3c4e5912-59dc-40b7-a482-25c6c6d38ccc","displayName":"RelSci","description":"Integrate people and relationship intelligence.","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"risk-engine","id":"8d08ed75-b71d-4d1a-a4c4-f17ead5c1954","displayName":"Risk Engine","description":"Calculate health risks with dacadoo Risk Engine","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"rocket-mainframe-data","id":"c14c9e07-7039-44a7-8eed-c508135829ac","displayName":"Rocket Mainframe Data","description":"Rocket Mainframe Data Service on IBM Cloud provides an easy way to leverage your mainframe data for new cloud services and mobile apps. Built on our proven data virtualization technology, this new mainframe data provides access to a breadth of data sources--without worrying about the underlying data format. Developers have the flexibility to use either MongoDB or SQL (JDBC) to access data on z Systems. With Rocket Mainframe Data Service on IBM Cloud, developers working in IBM Cloud now have an agile method for incorporating system of record data on z Systems into cloud or mobile applications.","planUpdateable":false,"plans":[{"name":"user-provided-beta","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"schematics","id":"schematics","displayName":"Schematics","description":"Enable Infrastructure as Code and automate the management of IBM Cloud service and Terraform.","planUpdateable":false,"plans":[{"name":"lite","description":"Workspace plan to allow registration of workspaces as sub-resources in ResourceController"},{"name":"lite","description":"Lite plan"}]},{"name":"securegateway","id":"IBM_SecureGateway","displayName":"Secure Gateway","description":"IBM Secure Gateway for IBM Cloud enables users to integrate cloud services with enterprise systems on premises.","planUpdateable":true,"plans":[{"name":"enterprise","description":"Up to 25 gateways with 25 destinations each and 500GB of included allowance for data transmission."},{"name":"essentials","description":"1 gateway with 1 destination and 500MB of included allowance for data transmission."},{"name":"professional","description":"Up to 5 gateways with 5 destinations each and 50GB of included allowance for data transmission."}]},{"name":"security-advisor","id":"ab1b0890-573c-11e8-9a9e-e3bf6f543902","displayName":"Security Advisor","description":"A unified security dashboard and console to enable centralized management for the security team","planUpdateable":true,"plans":[{"name":"lite","description":"Plan for IBM Cloud Security Advisor"}]},{"name":"sizeup-small-business-intelligence","id":"151a321c-6289-420c-bce5-b2e9525c38a7","displayName":"SizeUp Small Business Intelligence","description":"SizeUp Provides Big Data for Small Businesses","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"skytap","id":"fdf77820-deed-11e9-911d-5f09017358ff","displayName":"Skytap On IBM Cloud","description":"Skytap is a cloud service designed specifically to natively run AIX, Linux and IBM i on POWER and x86, Windows and Linux traditional enterprise applications.","planUpdateable":false,"plans":[{"name":"skytap-pay-as-you-go","description":"Standard pay-as-you-go plan. Ideal for workloads that change usage levels dramatically over time."}]},{"name":"speech-to-text","id":"bc35fb8c-bc5b-431b-859e-3861771d5843","displayName":"Speech to Text","description":"Low-latency, streaming transcription","planUpdateable":true,"plans":[{"name":"lite","description":"The Lite plan gets you started with 500 minutes per month at no cost. When you upgrade to a paid plan, you will get access to Customization capabilities."},{"name":"premium","description":"To purchase a premium plan, visit: https://ibm.biz/contact-wdc-premium"},{"name":"standard","description":"The following add-on charge will be applied if the language model customization feature is used:"}]},{"name":"splice-pre-cat-insurance-notifications","id":"e7623978-519a-42e1-ba8f-67a10a883e3f","displayName":"SPLICE Pre-CAT Insurance Notifications","description":"Pre-CAT Notifications for Insurance Companies","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"spplus","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-spplus","displayName":"IBM Spectrum Protect Plus","description":"Simplify data protection, availability, and access for your VMware environment.","planUpdateable":false,"plans":[]},{"name":"sql-query","id":"a0814030-c9dd-11e7-9a5e-19d80fed5e00","displayName":"SQL Query","description":"Read, analyze, and store data in Cloud Object Storage with ANSI SQL.","planUpdateable":true,"plans":[{"name":"lite","description":"The Lite plan provides access to the full functionality of IBM Cloud SQL Query for development and evaluation. Constraints align around concurrency, data volume scanned per day, and priority of queries."},{"name":"standard","description":"The Standard plan provides access to the full functionality of IBM Cloud SQL Query and can scale as needed for all use cases. The cost is calculated per Terabyte of Data scanned with your queries per month. There is no charge for failed queries and canceled queries are charged based on the data scanned up until cancellation."}]},{"name":"strands-business-financial-management","id":"38ae3340-b0f3-470e-b0fc-db28f19be7da","displayName":"Strands Business Financial Management","description":"Business Financial Management","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"streaming-analytics","id":"5acdbc42-8965-48f9-8a3c-1c728b6ed2c4","displayName":"Streaming Analytics","description":"Leverage IBM Streams to ingest, analyze, monitor, and correlate data as it arrives from real-time data sources. View information and events as they unfold.","planUpdateable":true,"plans":[{"name":"enhanced-container-hourly","description":"Each service instance is created with dedicated application nodes.  Additional application nodes can be added from the service dashboard.  Node hours only accumulate while the service instance is started."},{"name":"enhanced-container-monthly","description":"Each service instance is created with dedicated application nodes.  Additional application nodes can be added from the service dashboard.  Node months are calculated from the maximum number of application nodes used during the month."},{"name":"enhanced-container-subscription","description":"This plan is only available for purchase through an IBM sales representative.  You may purchase any number of application nodes for your IBM Cloud service instance.  To learn more, please contact a sales representative at strmadmn@ca.ibm.com."},{"name":"entry-container-hourly","description":"Each service instance is created with dedicated application nodes.  Additional application nodes can be added from the service dashboard.  Node hours only accumulate while the service instance is started."},{"name":"entry-container-lite","description":"The Lite plan provides access to the full function of Streaming Analytics for evaluation.  The plan has a set amount of provisioned compute resources.  Lite plan services are limited to 50 hours of use each calendar month."},{"name":"entry-container-monthly","description":"Each service instance is created with dedicated application nodes.  Additional application nodes can be added from the service dashboard.  Node months are calculated from the maximum number of application nodes used during the month."},{"name":"entry-container-subscription","description":"This plan is only available for purchase through an IBM sales representative.  You may purchase any number of application nodes for your IBM Cloud service instance.  To learn more, please contact a sales representative at strmadmn@ca.ibm.com."},{"name":"premium-container-hourly","description":"Each service instance is created with dedicated application nodes.  Additional application nodes can be added from the service dashboard.  Node hours only accumulate while the service instance is started."},{"name":"premium-container-monthly","description":"Each service instance is created with dedicated application nodes.  Additional application nodes can be added from the service dashboard.  Node months are calculated from the maximum number of application nodes used during the month."},{"name":"premium-container-subscription","description":"This plan is only available for purchase through an IBM sales representative.  You may purchase any number of application nodes for your IBM Cloud service instance.  To learn more, please contact a sales representative at strmadmn@ca.ibm.com."}]},{"name":"sysdig-monitor","id":"090c2c10-8c38-11e8-bec2-493df9c49eb8","displayName":"IBM Cloud Monitoring with Sysdig","description":"Offers visibility into the performance and health of your infrastructure and apps, with in-depth troubleshooting, and alerting.","planUpdateable":true,"plans":[{"name":"graduated-tier","description":"The pricing guidance above illustrates the actual hourly and unit pricing below. \nService consumption is measured hourly with the exception of the API calls."},{"name":"lite","description":"Free for 30 days"}]},{"name":"telstra-messaging-api","id":"983cd952-9671-47a7-908a-f59a076eb933","displayName":"Telstra Messaging API","description":"Send and receive SMS/MMS messages globally.","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"text-to-speech","id":"282c1d79-9176-4597-9cff-941a8d6cfd4c","displayName":"Text to Speech","description":"Synthesizes natural-sounding speech from text.","planUpdateable":true,"plans":[{"name":"lite","description":"The Lite plan gets you started with 10,000 characters per month at no cost. When you upgrade to a paid plan, you will get access to Customization capabilities."},{"name":"premium","description":"To purchase a premium plan, visit: https://ibm.biz/contact-wdc-premium"},{"name":"standard","description":"You will be charged per thousand characters"}]},{"name":"tone-analyzer","id":"8cf956de-e7c2-4a02-8f3b-ae554fa55cf8","displayName":"Tone Analyzer","description":"Tone Analyzer uses linguistic analysis to detect three types of tones from communications: emotion, social, and language.  This insight can then be used to drive high impact communications.","planUpdateable":true,"plans":[{"name":"lite","description":"The Lite plan gets you started with 2,500 API calls per month at no cost."},{"name":"premium","description":"To purchase a premium plan, visit: https://ibm.biz/contact-wdc-premium"},{"name":"standard","description":"You will be charged per API call."}]},{"name":"toolchain","id":"e512e5f0-64fb-11e8-9c23-830c05b8b729","displayName":"Toolchain","description":"Integrate tools to build, test, and deploy applications by using DevOps best practices.","planUpdateable":false,"plans":[{"name":"lite","description":"Toolchain provision behind service lite plan"}]},{"name":"totum-risk","id":"10dcbebb-c6e6-40c8-a5ba-10b7fc16d38a","displayName":"Totum Risk","description":"Risk tolerance tool for financial advisors","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"tradeit","id":"7e72e70b-546c-4dea-abe9-8a9a81f44943","displayName":"TradeIt","description":"TradeIt enables developers to link to brokers.","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"transit.gateway","id":"f38a4da0-c353-11e9-83b6-a36a57a97a06","displayName":"Transit Gateway","description":"Creates secure connectivity between your networks within IBM Cloud.","planUpdateable":true,"plans":[{"name":"transit-gateway-standard-plan","description":"Transit Gateway is a network service that is used to interconnect your IBM Cloud Classic and Virtual Private Cloud (VPC) resources across local and global regions."}]},{"name":"twilio-authy","id":"1e6f57b6-08fa-4579-b792-96eb536868e4","displayName":"Twilio Authy","description":"Secure your users with 2FA for mobile and web.","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"twilio-programmable-sms","id":"645ca653-38b8-4bbe-a532-f3511683d65a","displayName":"Twilio Programmable SMS","description":"Not just an API to exchange SMS text messages.","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"twilio-programmable-video","id":"652414f6-7c44-4faa-8075-5b9219e9a05a","displayName":"Twilio Programmable Video","description":"Embed WebRTC video calling into web & mobile apps.","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"twilio-programmable-voice","id":"477c8d09-81e9-48e2-b04c-6157bb2f234f","displayName":"Twilio Programmable Voice","description":"Build calling experiences with Twilio’s Voice API.","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"twilio-verify","id":"efe0bdb3-7a00-44e9-bb4b-3d6209d5d3c4","displayName":"Twilio Verify","description":"Check phone numbers, reduce fraud, increase trust.","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"ucloud-multitenant-core-platform-for-vmware","id":"5f5fa0b9-fd41-4d55-8f4b-81a154580170","displayName":"uCloud Multitenant Core Platform for VMware","description":"Management of public, private and hybrid cloud","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI. Create this service using the IBM Cloud console."}]},{"name":"unificationengine","id":"ed1c54af-979b-47eb-b97a-4b6aa4aaebfb","displayName":"UnificationEngine","description":"Intelligent IoT messaging for all H2M communications.","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"vcenterserver","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-vcenterserver","displayName":"VMware vCenter Server","description":"Standardized software-defined data center (SDDC) solution that combines IBM Cloud Bare Metal Servers with VMware vSphere, NSX, and optional vSAN for a seamless hybrid cloud experience.","planUpdateable":false,"plans":[]},{"name":"vcstrial","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-vcstrial","displayName":"Single-node Trial for Migration and App Modernization","description":"Test drive IBM Cloud's end-to-end application modernization solution by lifting, shifting, and transforming applications in this 90-day trial.","planUpdateable":false,"plans":[]},{"name":"vcstrial_dr","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-vcstrial_dr","displayName":"Single-node Trial for Data Protection and Disaster Recovery","description":"Test drive IBM Cloud's end-to-end data protection and disaster recovery solution by lifting, shifting, and transforming applications in this 90-day trial.","planUpdateable":false,"plans":[]},{"name":"veeam","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-veeam","displayName":"Veeam","description":"Enable the Always-On Enterprise by providing data centers with high-speed recovery and data loss avoidance.","planUpdateable":false,"plans":[]},{"name":"vmware-solutions","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83","displayName":"VMware Solutions","description":"IBM Cloud for VMware Solutions","planUpdateable":true,"plans":[{"name":"dedicated-vcd","description":"Dedicated plan for VCD"},{"name":"default-vmware-solutions","description":"Default Plan for VMware Solutions"},{"name":"on-demand-vcd","description":"On-demand plan for VCD"},{"name":"organization-vcd","description":"Organization plan for services"},{"name":"reserved-vcd","description":"Reserved plan for VCD"},{"name":"standard-vmware-solutions","description":"Standard Plan for  VMware Solutions"}]},{"name":"voiceagent","id":"VoiceAgent09152017","displayName":"Voice Agent with Watson","description":"Create a cognitive voice agent that uses Watson services to speak directly with customers using natural language over the telephone","planUpdateable":true,"plans":[{"name":"lite","description":"Once you reach either 100 minutes of calls or 100 SMS/MMS messages the service will be unable to accept calls and send/receive messages. This plan is not inclusive of Watson service usage - Watson services are tracked and charged separately according to their service plans."},{"name":"plus","description":"To purchase a plus plan, visit: https://ibm.biz/WAVI-Plus"},{"name":"standard","description":"1,000 free call minutes and 500 free SMS/MMS messages per month. This plan is not inclusive of Watson service usage - Watson services are tracked and charged separately according to their service plans."}]},{"name":"vrops","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-vrops","displayName":"vRealize Operations and Log Insight","description":"Monitor and troubleshoot the performance, health, and capacity of your dedicated IBM-hosted VMware Software Defined Data Center (SDDC) stack, in a more efficient matter.","planUpdateable":false,"plans":[]},{"name":"vsphere","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-vsphere","displayName":"VMware vSphere","description":"Customizable virtualization service that combines VMware-compatible bare metal servers, hardware components, and licenses, to build your own IBM-hosted VMware environment.","planUpdateable":false,"plans":[]},{"name":"watson-vision-combined","id":"700c7e8b-6609-71eb-e136-0a0f0ef9c2a2","displayName":"Visual Recognition","description":"Find meaning in visual content! Analyze images for scenes, objects, and other content. Choose a default model off the shelf, or create your own custom classifier. Develop smart applications that analyze the visual content of images or video frames to understand what is happening in a scene.","planUpdateable":true,"plans":[{"name":"lite","description":"The Lite Plan gets you started with 1,000 events (images) per month and the ability to train two Custom Models. Users wishing to use more premium features or increase usage must upgrade to a Standard Plan or a Subscription Plan."},{"name":"standard-rc","description":"The Watson Visual Recognition Standard Plan is pay per use, on an event (images) basis. Full pricing can be found below."}]},{"name":"wealthengine-api","id":"28aa8e2c-1121-4592-94ed-8b7414eb33be","displayName":"WealthEngine API","description":"Look up anyone's net worth in real-time.","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"websphereappsvr","id":"01231964-3f23-46f0-850e-07c7a02bb3a0","displayName":"WebSphere Application Server","description":"Allows you to quickly get up and running on a pre-configured WebSphere Application Server installation in a hosted cloud environment in IBM Cloud.","planUpdateable":false,"plans":[{"name":"wasbaseplan","description":"This plan provisions traditional WebSphere Application Server Base on a hosted Red Hat Linux operating system. The price shown reflects an hour for one instance which is defined as 1vCPU with 2GB RAM and 25GB HD. Billing increases based on the instance size."},{"name":"waslibertycoreplan","description":"This plan provisions WebSphere Application Server Liberty Core on a hosted Red Hat Linux operating system. The price shown reflects an hour for one instance which is defined as 1vCPU with 2GB RAM and 25GB HD. Billing increases based on the instance size."},{"name":"wasndplan","description":"This plan provisions WebSphere Application Server Network Deployment on a hosted Red Hat Linux operating system. The price shown reflects an hour for one instance which is defined as 1vCPU with 2GB RAM and 25GB HD. Billing increases based on the instance size and on the number of instances."}]},{"name":"xignite-market-data-apis","id":"f8a3f6e9-3a1b-4559-a529-26e94702518d","displayName":"Xignite Market Data APIs","description":"Real-time and reference market data","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"ylabs","id":"bdd3cc41-1774-4bf7-9044-22d93dfa6853","displayName":"Ylabs","description":"Full banking stack with enhanced KYC and real time risk monitoring.","planUpdateable":false,"plans":[{"name":"user-provided","description":"This service cannot be created via the CLI.  Create this service using the IBM Cloud console."}]},{"name":"zerto","id":"cf329950-0a3e-11e8-922e-f1366c6e1c83-zerto","displayName":"Zerto","description":"Replicate your VMs between data centers in the public cloud or between the public cloud and your on-premises data centers","planUpdateable":false,"plans":[]}]